yo3gwm/ESP32APRS_Audio/src/main.cpp
/*
 Name:		ESP32 APRS Internet Gateway
 Created:	1-Nov-2021 14:27:23
 Author:	HS5TQA/Atten
 Support IS: host:aprs.dprns.com port:14580
 Support IS monitor: http://aprs.dprns.com:14501
 Support in LINE Group APRS Only
*/

#include <Arduino.h>
#include <esp_task_wdt.h>
#include "main.h"
#include <LibAPRSesp.h>
#include <limits.h>
#include <KISS.h>
#include "webservice.h"
#include <WiFiUdp.h>
#include "ESP32Ping.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClient.h>
#include "cppQueue.h"
#include "digirepeater.h"
#include "igate.h"
#include "message.h"
#include "wireguardif.h"
#include "wireguard.h"
#include "esp_wifi.h"

#include <TinyGPS++.h>
#include <pbuf.h>
#include <parse_aprs.h>

#include <Fonts/FreeSansBold9pt7b.h>
#include <Fonts/FreeSerifItalic9pt7b.h>
#include "Font/Seven_Segment24pt7b.h"

#include "wireguard_vpn.h"
#include <WiFiUdp.h>

#include <WiFiClientSecure.h>

#include <SoftwareSerial.h>
// SoftwareSerial ss(-1, -1);

#include <ModbusMaster.h>

#include "handleATCommand.h"

#include "sensor.h"

#include <rom/spi_flash.h>
#include "FS.h"
#include <LITTLEFS.h>

#include <time.h>

#ifdef MQTT
#include <PubSubClient.h>
#endif

#include "AFSK.h"
#include "esp_freertos_hooks.h"

#ifdef PPPOS
#include <PPP.h>
#define PPP_MODEM_APN "internet"
#define PPP_MODEM_PIN "0000" // or NULL
#define PPP_MODEM_RST_DELAY 500
#define PPP_MODEM_RST 13
#define PPP_MODEM_RST_LOW true // active LOW
#define PPP_MODEM_TX 12
#define PPP_MODEM_RX 11
#define PPP_MODEM_RTS -1
#define PPP_MODEM_CTS -1
#define PPP_MODEM_FC ESP_MODEM_FLOW_CONTROL_NONE
#define PPP_MODEM_MODEL PPP_MODEM_SIM800
#endif

#define CONFIG_I2C_ENABLE_DEBUG_LOG 0

#define EEPROM_SIZE 4096

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0)
#ifdef __XTENSA__
#define BOOT_PIN 9
#else
#define BOOT_PIN 0
#endif
#endif

#include <Wire.h>
#ifndef __XTENSA__
TwoWire Wire1 = TwoWire(1);
#endif
#ifdef OLED
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>

#if defined(SSD1306_72x40)
#define SCREEN_WIDTH 72  // OLED display width, in pixels
#define SCREEN_HEIGHT 40 // OLED display height, in pixels
#else
#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
#endif

// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
#ifdef SH1106
#include <Adafruit_SH1106.h>
#define OLED_RESET -1
#define SCREEN_ADDRESS 0x3C ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SH1106 display(OLED_RESET);
#else
#include <Adafruit_SSD1306.h>
#define OLED_RESET -1
#ifdef SSD1306_72x40
#define SSD1306_NO_SPLASH
#define SCREEN_ADDRESS 0x3C
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
#else
#define SCREEN_ADDRESS 0x3C //(0x3C for 32-pixel-tall displays, 0x3D for all others).
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
#endif

#endif

#endif

#define FORMAT_LITTLEFS_IF_FAILED true
extern fs::LITTLEFSFS LITTLEFS;

bool i2c_busy = false;

struct pbuf_t aprs;
ParseAPRS aprsParse;

TinyGPSPlus gps;

// instantiate ModbusMaster object
ModbusMaster modbus;

// #ifdef __XTENSA__
// #define BOOT_PIN 0
// #else
// #define BOOT_PIN 9
// #endif

#define VBAT_PIN 35
// #define WIRE 4
//  #define POWER_PIN 12
//  #define PULLDOWN_PIN 27
//  #define SQL_PIN 33

// #define MODEM_PWRKEY 5
// #define MODEM_TX 17
// #define MODEM_RX 16
#include <Adafruit_NeoPixel.h>
Adafruit_NeoPixel *strip = NULL;

#ifdef STRIP_PIN
#define LED_TX -1
#define LED_RX -1
// portMUX_TYPE ledMux = portMUX_INITIALIZER_UNLOCKED;
void IRAM_ATTR LED_Status(uint8_t r, uint8_t g, uint8_t b)
{
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    strip->setPixelColor(0, strip->Color(r, g, b));
    strip->show();
    // portEXIT_CRITICAL_ISR(&ledMux);
}
#else
#define LED_TX 4
#define LED_RX 2
void LED_Status(uint8_t r, uint8_t g, uint8_t b)
{
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    if (LED_TX > -1)
    {
        if (r > 0)
            digitalWrite(LED_TX, HIGH);
        else
            digitalWrite(LED_TX, LOW);
    }
    if (LED_RX > -1)
    {
        if (g > 0)
            digitalWrite(LED_RX, HIGH);
        else
            digitalWrite(LED_RX, LOW);
    }
    // portEXIT_CRITICAL_ISR(&ledMux);
}
#endif

#define PPP_APN "internet"
#define PPP_USER ""
#define PPP_PASS ""

const char *str_status[] = {
    "IDLE_STATUS",
    "NO_SSID_AVAIL",
    "SCAN_COMPLETED",
    "CONNECTED",
    "CONNECT_FAILED",
    "CONNECTION_LOST",
    "DISCONNECTED"};

WiFiMulti wifiMulti;

time_t systemUptime = 0;
time_t wifiUptime = 0;

uint8_t Sleep_Activate = 0;
unsigned long StandByTick = 0;

bool lastHeard_Flag = 0;

boolean KISS = false;
bool aprsUpdate = false;

long timeSleep = 0;

boolean gotPacket = false;
AX25Msg incomingPacket;

bool lastPkg = false;
bool afskSync = false;
float dBV = 0;
int mVrms = 0;
float rssi = 0;
float snr = 0;
float freqErr = 0;

extern volatile int8_t adcEn;
extern volatile int8_t dacEn;
extern volatile bool pttOff;
extern volatile bool hw_afsk_dac_isr;
extern volatile unsigned long pttActiveSince;
extern volatile uint32_t adcIsrCount;
extern volatile int fifoSampleCount;
extern volatile uint32_t fifoOverflowCount;
extern volatile uint32_t frameDecodeCount;

long timeNetwork, timeAprs, timeGui;
long autoResetTimeout = 0;

// cppQueue PacketBuffer(sizeof(AX25Msg), 5, IMPLEMENTATION); // Instantiate queue
#ifdef OLED
cppQueue dispBuffer(300, 5, IMPLEMENTATION);
cppQueue queTxDisp(sizeof(txDisp), 5, IMPLEMENTATION); // Instantiate queue

void pushTxDisp(uint8_t ch, const char *name, char *info)
{
    if (!config.tx_display)
        return;

    txDisp pkg;

    pkg.tx_ch = ch;
    strcpy(pkg.name, name);
    strcpy(pkg.info, info);
    queTxDisp.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
}
#endif

statusType status;
RTC_DATA_ATTR igateTLMType igateTLM;
RTC_DATA_ATTR dataTLMType systemTLM;
txQueueType *txQueue;

RTC_DATA_ATTR double LastLat, LastLng;
RTC_DATA_ATTR time_t lastTimeStamp;
RTC_DATA_ATTR uint32_t COUNTER0_RAW;
RTC_DATA_ATTR uint32_t COUNTER1_RAW;

extern RTC_DATA_ATTR uint8_t digiCount;

String RF_VERSION;

Configuration config;

pkgListType *pkgList;

TelemetryType *Telemetry;

RTC_DATA_ATTR double VBat;
RTC_DATA_ATTR bool VBat_Flag = false;
RTC_DATA_ATTR double TempNTC;

RTC_NOINIT_ATTR uint16_t TLM_SEQ;
RTC_NOINIT_ATTR uint16_t IGATE_TLM_SEQ;
RTC_NOINIT_ATTR uint16_t DIGI_TLM_SEQ;

TaskHandle_t taskNetworkHandle;
TaskHandle_t taskAPRSHandle;
TaskHandle_t taskAPRSPollHandle;
TaskHandle_t taskSerialHandle;
TaskHandle_t taskGPSHandle;
TaskHandle_t taskSensorHandle;

