yo3gwm/ESP32APRS_Audio/src/main.cpp
void logDigi(double lat, double lon, double speed, double course)
{
    char data[200];
    char datetime[30];
    char dfName[30];
    bool header = false;
    double dist;
    time_t nowTime;

    if (gps.time.isValid())
    {
        time_t timeGps = getGpsTime(); // Local gps time
        time(&nowTime);
        int tdiff = abs(timeGps - nowTime);
        if (timeGps > 1700000000 && tdiff > 2) // && timeGps < 2347462800)
        {
            nowTime = timeGps;
            setTime(nowTime);
            time_t rtc = nowTime - (time_t)(config.timeZone * (float)SECS_PER_HOUR);
            timeval tv = {rtc, 0};
            timezone tz = {(int)(config.timeZone * (float)SECS_PER_HOUR), 0};
            settimeofday(&tv, &tz);
        }
    }
    else
    {
        time(&nowTime);
    }

    String col;
    struct tm tmstruct;
    getLocalTime(&tmstruct, 100);
    sprintf(dfName, "/digi_%02d%d.csv", (tmstruct.tm_mon) + 1, (tmstruct.tm_year) + 1900);

    if (lastTimeStamp == 0)
        lastTimeStamp = nowTime;
    time_t tdiff = nowTime - lastTimeStamp;
    double nowLat = gps.location.lat();
    double nowLng = gps.location.lng();
    double spd = gps.speed.kmph();

    // dist = distance(LastLng, LastLat, nowLng, nowLat);

    if (spd < 5)
    {

        dist = gps.distanceBetween(LastLng, LastLat, nowLng, nowLat);
        course = direction(LastLng, LastLat, nowLng, nowLat);
        if (dist > 50.0F)
            dist = 0;
        if (tdiff > 10 && (nowTime > lastTimeStamp))
            speed = dist / ((double)tdiff / 3600);
        else
            speed = 0.0F;

        if (speed > 5)
        {
            speed = gps.speed.kmph();
            course = gps.course.deg();
        }
    }
    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;

    if (!LITTLEFS.exists(dfName))
    {
        header = true;
    }

    File f = LITTLEFS.open(dfName, "a");
    if (!f)
    {
        Serial.printf("[LOG] Failed to open %s for writing\r\n", dfName);
    }
    else
    {
        if (header)
        {
            // col = "\"dd/mm/yyyy h:m\",\"Weight Origin(Kg)\",\"Weight(Kg)\",\"Water Drain(L)\",\"Water Height(mm)\",\"Temperature(C)\",\"Raw\"";
            col = "dd/mm/yyyy h:m:s";
            col += ",Latitude";
            col += ",Longitude";
            col += ",Speed(kph)";
            col += ",Course(°)";
            for (int i = 0; i < 5; i++)
            {
                if (config.digi_tlm_sensor[i] > 0)
                {
                    col += "," + String(config.digi_tlm_PARM[i]) + "(" + String(config.digi_tlm_UNIT[i]) + ")";
                }
            }
            f.println(col);
        }
        sprintf(datetime, "%d-%02d-%02d %02d:%02d:%02d", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        sprintf(data, "%s,%0.5f,%0.5f,%0.2f,%d", datetime, lat, lon, speed, (int)course);
        for (int s = 0; s < 5; s++)
        {
            if (config.digi_tlm_sensor[s] == 0)
            {
                continue;
                // strcat(tlm_data, "0");
            }
            else
            {
                strcat(data, ",");
                int sen_idx = config.digi_tlm_sensor[s] - 1;
                double val = 0;
                if (sen[sen_idx].visable)
                {
                    if (config.digi_tlm_avg[s] && (sen[sen_idx].timeAvg > 0))
                        val = sen[sen_idx].average;
                    else
                        val = sen[sen_idx].sample;
                }
                strcat(data, String(val, 2).c_str());
            }
        }
        f.println(data);
        f.close();
#ifdef DEBUG
        log_d("Data file updated");
#endif
    }
}

void logWeather(double lat, double lon, double speed, double course)
{
    char data[500];
    char datetime[30];
    char dfName[30];
    bool header = false;
    double dist;
    time_t nowTime;

    if (gps.time.isValid())
    {
        time_t timeGps = getGpsTime(); // Local gps time
        time(&nowTime);
        int tdiff = abs(timeGps - nowTime);
        if (timeGps > 1700000000 && tdiff > 2) // && timeGps < 2347462800)
        {
            nowTime = timeGps;
            setTime(nowTime);
            time_t rtc = nowTime - (time_t)(config.timeZone * (float)SECS_PER_HOUR);
            timeval tv = {rtc, 0};
            timezone tz = {(int)(config.timeZone * (float)SECS_PER_HOUR), 0};
            settimeofday(&tv, &tz);
        }
    }
    else
    {
        time(&nowTime);
    }

    String col;
    struct tm tmstruct;
    getLocalTime(&tmstruct, 100);
    sprintf(dfName, "/wx_%02d%d.csv", (tmstruct.tm_mon) + 1, (tmstruct.tm_year) + 1900);

    if (lastTimeStamp == 0)
        lastTimeStamp = nowTime;
    time_t tdiff = nowTime - lastTimeStamp;
    double nowLat = gps.location.lat();
    double nowLng = gps.location.lng();
    double spd = gps.speed.kmph();

    // dist = distance(LastLng, LastLat, nowLng, nowLat);

    if (spd < 5)
    {

        dist = gps.distanceBetween(LastLng, LastLat, nowLng, nowLat);
        course = direction(LastLng, LastLat, nowLng, nowLat);
        if (dist > 50.0F)
            dist = 0;
        if (tdiff > 10 && (nowTime > lastTimeStamp))
            speed = dist / ((double)tdiff / 3600);
        else
            speed = 0.0F;

        if (speed > 5)
        {
            speed = gps.speed.kmph();
            course = gps.course.deg();
        }
    }
    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;

    if (!LITTLEFS.exists(dfName))
    {
        header = true;
    }

    File f = LITTLEFS.open(dfName, "a");
    if (!f)
    {
        Serial.printf("[LOG] Failed to open %s for writing\r\n", dfName);
    }
    else
    {
        if (header)
        {
            // col = "\"dd/mm/yyyy h:m\",\"Weight Origin(Kg)\",\"Weight(Kg)\",\"Water Drain(L)\",\"Water Height(mm)\",\"Temperature(C)\",\"Raw\"";
            col = "dd/mm/yyyy h:m:s";
            col += ",Latitude";
            col += ",Longitude";
            col += ",Speed(kph)";
            col += ",Course(°)";
            for (int s = 0; s < WX_SENSOR_NUM; s++)
            {
                int senIdx = config.wx_sensor_ch[s];
                if ((config.wx_sensor_enable[s] == 0) || (senIdx == 0))
                {
                    continue;
                }
                else
                {
                    senIdx -= 1;
                    col += "," + String(String(WX_SENSOR[s])) + "(" + String(config.sensor[senIdx].unit) + ")";
                }
            }
            f.println(col);
        }
        sprintf(datetime, "%d-%02d-%02d %02d:%02d:%02d", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        sprintf(data, "%s,%0.5f,%0.5f,%0.2f,%d", datetime, lat, lon, speed, (int)course);
        for (int s = 0; s < WX_SENSOR_NUM; s++)
        {
            int senIdx = config.wx_sensor_ch[s];
            if ((config.wx_sensor_enable[s] == 0) || (senIdx == 0))
            {
                continue;
            }
            else
            {
                strcat(data, ",");
                senIdx -= 1;
                double val = 0;
                if (sen[senIdx].visable)
                {
                    if ((config.wx_sensor_avg[s] && (config.sensor[senIdx].averagerate <= config.sensor[senIdx].samplerate)) || (sen[senIdx].timeAvg == 0))
                        val = sen[senIdx].sample;
                    else
                        val = sen[senIdx].average;
                }
                strcat(data, String(val, 2).c_str());
            }
        }
        f.println(data);
        f.close();
#ifdef DEBUG
        log_d("Data file updated");
#endif
    }
}

void defaultConfig()
{
    log_d("Default configure mode!");
    #ifdef __XTENSA__
    config.cpuFreq = 240;
    #else
    config.cpuFreq = 160;
    #endif
    config.synctime = true;
    config.timeZone = 7;
    config.tx_timeslot = 200; // ms

    config.wifi_mode = WIFI_AP_STA_FIX;
    config.wifi_power = 44; // WIFI_POWER_11dBm
    config.wifi_ap_ch = 6;
    config.wifi_sta[0].enable = true;
    sprintf(config.wifi_sta[0].wifi_ssid, "APRSTH");
    sprintf(config.wifi_sta[0].wifi_pass, "aprsthnetwork");
    for (int i = 1; i < 5; i++)
    {
        config.wifi_sta[i].enable = false;
        config.wifi_sta[i].wifi_ssid[0] = 0;
        config.wifi_sta[i].wifi_pass[0] = 0;
    }
    sprintf(config.wifi_ap_ssid, "ESP32APRS_Audio");
    sprintf(config.wifi_ap_pass, "aprsthnetwork");

    // Blutooth
    config.bt_slave = false;
    config.bt_master = false;
    config.bt_mode = 1; // 0-None,1-TNC2RAW,2-KISS
    config.bt_power = 3;
    sprintf(config.bt_name, "ESP32APRS_Audio");
    config.bt_pin = 0;
#if !defined(CONFIG_IDF_TARGET_ESP32)
    // Bluetooth BLE
    sprintf(config.bt_uuid, "00000001-ba2a-46c9-ae49-01b0961f68bb");
    sprintf(config.bt_uuid_rx, "00000002-ba2a-46c9-ae49-01b0961f68bb");
    sprintf(config.bt_uuid_tx, "00000003-ba2a-46c9-ae49-01b0961f68bb");
#endif

