yo3gwm/ESP32APRS_Audio/src/main.cpp
// OLED DISPLAY
#ifdef OLED
    config.oled_enable = true;
#else
    config.oled_enable = false;
#endif
    config.oled_timeout = 60;
    config.dim = 0;
    config.contrast = 0;
    config.startup = 0;

    // Display
    config.disp_brightness = 250;
    config.disp_flip = false;
    config.dispDelay = 3; // Popup display 3 sec
    config.dispRF = true;
    config.dispINET = false;
    config.filterDistant = 0;
    config.dispFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX | FILTER_STATUS | FILTER_BUOY | FILTER_QUERY;
    config.h_up = true;
    config.tx_display = true;
    config.rx_display = true;

    // afsk,TNC
    sprintf(config.ntp_host, "ntp.nakhonthai.net");

    sprintf(config.path[0], "WIDE1-1");
    sprintf(config.path[1], "WIDE1-1,WIDE2-1");
    sprintf(config.path[2], "TRACK3-3");
    sprintf(config.path[3], "RS0ISS");

    // VPN Wireguard
    config.vpn = false;
    config.wg_port = 51820;
    sprintf(config.wg_peer_address, "vpn.nakhonthai.net");
    sprintf(config.wg_local_address, "192.168.1.2");
    sprintf(config.wg_netmask_address, "255.255.255.0");
    sprintf(config.wg_gw_address, "192.168.1.1");
    sprintf(config.wg_public_key, "");
    sprintf(config.wg_private_key, "");

    sprintf(config.http_username, "admin");
    sprintf(config.http_password, "admin");

    // config.gnss_baudrate = 9600;
    config.gnss_enable = false;
    // config.gnss_tx_gpio = 19;
    // config.gnss_rx_gpio = 18;
    // config.gnss_pps_gpio = -1;
    config.gnss_tcp_port = 8080;
    sprintf(config.gnss_tcp_host, "192.168.0.1");
    memset(config.gnss_at_command, 0, sizeof(config.gnss_at_command));

    config.sensor[0].enable = false;
    config.sensor[0].port = 0;
    config.sensor[0].address = 2;
    config.sensor[0].samplerate = 10;
    config.sensor[0].averagerate = 600;
    config.sensor[0].eqns[0] = 0; // a
    config.sensor[0].eqns[1] = 1; // b
    config.sensor[0].eqns[2] = 0; // c
    config.sensor[0].type = SENSOR_TEMPERATURE;
    sprintf(config.sensor[0].parm, "Temperature");
    sprintf(config.sensor[0].unit, "°C");

    config.sensor[1].enable = false;
    config.sensor[1].port = 0;
    config.sensor[1].address = 2;
    config.sensor[1].samplerate = 10;
    config.sensor[1].averagerate = 600;
    config.sensor[1].eqns[0] = 0; // a
    config.sensor[1].eqns[1] = 1; // b
    config.sensor[1].eqns[2] = 0; // c
    config.sensor[1].type = SENSOR_HUMIDITY;
    sprintf(config.sensor[1].parm, "Humidity");
    sprintf(config.sensor[1].unit, "%%RH");

    config.sensor[2].enable = false;
    config.sensor[2].port = 0;
    config.sensor[2].address = 2;
    config.sensor[2].samplerate = 10;
    config.sensor[2].averagerate = 600;
    config.sensor[2].eqns[0] = 0; // a
    config.sensor[2].eqns[1] = 1; // b
    config.sensor[2].eqns[2] = 0; // c
    config.sensor[2].type = SENSOR_PM25;
    sprintf(config.sensor[2].parm, "PM2.5");
    sprintf(config.sensor[2].unit, "μg/m³");

    config.sensor[3].enable = false;
    config.sensor[3].port = 0;
    config.sensor[3].address = 2;
    config.sensor[3].samplerate = 10;
    config.sensor[3].averagerate = 600;
    config.sensor[3].eqns[0] = 0; // a
    config.sensor[3].eqns[1] = 1; // b
    config.sensor[3].eqns[2] = 0; // c
    config.sensor[3].type = SENSOR_PM100;
    sprintf(config.sensor[3].parm, "PM10.0");
    sprintf(config.sensor[3].unit, "μg/m³");

    config.sensor[4].enable = false;
    config.sensor[4].port = 0;
    config.sensor[4].address = 2;
    config.sensor[4].samplerate = 10;
    config.sensor[4].averagerate = 600;
    config.sensor[4].eqns[0] = 0; // a
    config.sensor[4].eqns[1] = 1; // b
    config.sensor[4].eqns[2] = 0; // c
    config.sensor[4].type = SENSOR_CO2;
    sprintf(config.sensor[4].parm, "CO2");
    sprintf(config.sensor[4].unit, "ppm");

    config.sensor[5].enable = false;
    config.sensor[5].port = 0;
    config.sensor[5].address = 2;
    config.sensor[5].samplerate = 10;
    config.sensor[5].averagerate = 600;
    config.sensor[5].eqns[0] = 0; // a
    config.sensor[5].eqns[1] = 1; // b
    config.sensor[5].eqns[2] = 0; // c
    config.sensor[5].type = SENSOR_CH2O;
    sprintf(config.sensor[5].parm, "CH2O");
    sprintf(config.sensor[5].unit, "μg/m³");

    config.sensor[6].enable = false;
    config.sensor[6].port = 0;
    config.sensor[6].address = 2;
    config.sensor[6].samplerate = 10;
    config.sensor[6].averagerate = 600;
    config.sensor[6].eqns[0] = 0; // a
    config.sensor[6].eqns[1] = 1; // b
    config.sensor[6].eqns[2] = 0; // c
    config.sensor[6].type = SENSOR_TVOC;
    sprintf(config.sensor[6].parm, "TVOC");
    sprintf(config.sensor[6].unit, "μg/m³");

    config.sensor[7].enable = false;
    config.sensor[7].port = 0;
    config.sensor[7].address = 2;
    config.sensor[7].samplerate = 10;
    config.sensor[7].averagerate = 600;
    config.sensor[7].eqns[0] = 0; // a
    config.sensor[7].eqns[1] = 1; // b
    config.sensor[7].eqns[2] = 0; // c
    config.sensor[7].type = SENSOR_PRESSURE;
    sprintf(config.sensor[7].parm, "Pressure");
    sprintf(config.sensor[7].unit, "hPa(mBar)");

    config.sensor[8].enable = false;
    config.sensor[8].port = 0;
    config.sensor[8].address = 2;
    config.sensor[8].samplerate = 10;
    config.sensor[8].averagerate = 600;
    config.sensor[8].eqns[0] = 0;   // a
    config.sensor[8].eqns[1] = 0.2; // b
    config.sensor[8].eqns[2] = 0;   // c
    config.sensor[8].type = SENSOR_RAIN;
    sprintf(config.sensor[8].parm, "Rain");
    sprintf(config.sensor[8].unit, "mm.");

    config.sensor[9].enable = false;
    config.sensor[9].port = 0;
    config.sensor[9].address = 2;
    config.sensor[9].samplerate = 10;
    config.sensor[9].averagerate = 600;
    config.sensor[9].eqns[0] = 0; // a
    config.sensor[9].eqns[1] = 1; // b
    config.sensor[9].eqns[2] = 0; // c
    config.sensor[9].type = SENSOR_WIND_SPD;
    sprintf(config.sensor[9].parm, "Wind Speed");
    sprintf(config.sensor[9].unit, "kPh");

// #ifdef CORE_DEBUG_LEVEL
//     config.uart0_enable = false;
//     config.uart0_baudrate = 115200;
//     config.uart0_rx_gpio = 20;
//     config.uart0_tx_gpio = 21;
//     config.uart0_rts_gpio = -1;
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    config.uart0_enable = false;
    config.uart0_baudrate = 115200;
    config.uart0_rx_gpio = 44;
    config.uart0_tx_gpio = 43;
    config.uart0_rts_gpio = -1;
#else
    config.uart0_enable = false;
    config.uart0_baudrate = 9600;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart0_rts_gpio = -1;
#endif

