yo3gwm/ESP32APRS_Audio/src/main.cpp
// void pushGwRaw(uint8_t *raw, uint8_t size)
// {
//     if (gwRaw_count > PKGLISTSIZE)
//         return;
//     if (++gwRaw_idx_rw >= PKGLISTSIZE)
//         gwRaw_idx_rw = 0;
//     if (size > 65)
//         size = 65;
//     memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
//     gwRawSize[gwRaw_idx_rw] = size;
//     gwRaw_count++;
// }

// uint8_t popGwRaw(uint8_t *raw)
// {
//     uint8_t size = 0;
//     if (gwRaw_count <= 0)
//         return 0;
//     if (++gwRaw_idx_rd >= PKGLISTSIZE)
//         gwRaw_idx_rd = 0;
//     size = gwRawSize[gwRaw_idx_rd];
//     memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
//     if (gwRaw_count > 0)
//         gwRaw_count--;
//     return size;
// }

bool SA8x8_waitResponse(String &data, String rsp, uint32_t timeout)
{
    uint32_t startMillis = millis();
    data.clear();
    do
    {
        while (SerialRF.available() > 0)
        {
            int8_t ch = SerialRF.read();
            data += static_cast<char>(ch);
            if (rsp.length() && data.endsWith(rsp))
            {
                return true;
            }
            // esp_task_wdt_reset();
        }
        delay(1);
        // esp_task_wdt_reset();
    } while (millis() - startMillis < timeout);
    return false;
}

int SA8x8_getRSSI()
{
    String data;
    int rssi;

    // Serial.printf("AT+RSSI?\r\n");
    SerialRF.printf("AT+RSSI?\r\n");
    if (SA8x8_waitResponse(data, "\r\n", 1000))
    {
        // Serial.println(INFO + data);
        String rssi = data.substring(data.indexOf("RSSI=") + strlen("RSSI="), data.indexOf("\r\n"));
        rssi = rssi.toInt();
        return rssi.toInt();
    }
    else
    {
        // timeout or error
        return 0;
    }
}

String SA8x8_getVERSION()
{
    String data;
    String rsp = "\r\n";

    // AT+DMOCONNECT required before other commands — without it SA818 returns +DMOERROR
    while (SerialRF.available()) SerialRF.read(); // flush stale bytes
    SerialRF.printf("AT+DMOCONNECT\r\n");
    if (!SA8x8_waitResponse(data, rsp, 1500))
        return "Connection error to SA8x8";

    SerialRF.printf("AT+VERSION\r\n");
    if (SA8x8_waitResponse(data, rsp, 4000))
    {
        String version = data.substring(0, data.indexOf("\r\n"));
        if (version.indexOf("DMOERROR") >= 0)
            return "Version not supported by this module";
        return version;
    }
    return "Connection error to SA8x8";
}

String FRS_getVERSION()
{
    String data;
    String version;

    SerialRF.printf("AT+DMOVERQ\r\n");
    if (SA8x8_waitResponse(data, "\r\n", 1000))
    {
        int st = data.indexOf("DMOVERQ:");
        if (st > 0)
        {
            version = data.substring(st + 8, data.indexOf("\r\n"));
        }
        else
        {
            version = "Not found";
        }
        return version;
    }
    else
    {
        // timeout or error
        return "-";
    }
}

unsigned long SA818_Timeout = 0;

// ── SA8x8 individual write helpers ──────────────────────────────────────────
// Each function: TX interlock → inhibit → flush → DMOCONNECT → command → result
// Returns "CMD: <cmd>\nRSP: <response>" for display in web popup.

static String SA8x8_checkType()
{
    if (config.rf_type == RF_SA8x8_VHF ||
        config.rf_type == RF_SA8x8_UHF ||
        config.rf_type == RF_SA8x8_350)
        return "";
    return "ERR: SA8x8 module type not configured in memory\n"
           "Select SA8x8 in Module Type and press Apply Change first.";
}

static String SA8x8_RunCommand(const char *cmd)
{
    String data, rsp = "\r\n";

    // Wait for any ongoing TX (max 5s)
    if (pttActiveSince > 0 || hw_afsk_dac_isr) {
        unsigned long ws = millis();
        while ((pttActiveSince > 0 || hw_afsk_dac_isr) && (millis() - ws) < 5000)
            delay(50);
        if (pttActiveSince > 0 || hw_afsk_dac_isr) {
            setPtt(false);
            pttOff = false;
        }
    }
    AFSK_SetTxInhibit(true);

    while (SerialRF.available()) SerialRF.read();
    SerialRF.printf("AT+DMOCONNECT\r\n");
    if (!SA8x8_waitResponse(data, rsp, 1000)) {
        AFSK_SetTxInhibit(false);
        return "ERR: Module not responding to AT+DMOCONNECT";
    }

    // Build display: strip trailing \r\n from cmd
    String cmdDisplay = cmd;
    cmdDisplay.trim();

    SerialRF.print(cmd);
    bool ok = SA8x8_waitResponse(data, rsp, 4000);
    String resp = ok ? data.substring(0, data.indexOf("\r\n")) : "TIMEOUT";

    AFSK_SetTxInhibit(false);

    return "CMD: " + cmdDisplay + "\nRSP: " + resp;
}

String RF_SA8x8_WriteGroup()
{
    String data;
    String rsp = "\r\n";

    // AT+DMOCONNECT required before other commands — without it SA818 returns +DMOERROR
    while (SerialRF.available()) SerialRF.read(); // flush stale bytes
    SerialRF.printf("AT+DMOCONNECT\r\n");
    if (!SA8x8_waitResponse(data, rsp, 1500))
        return "Connection error to SA8x8";
    { String e = SA8x8_checkType(); if (e.length()) return e; }
    float rf_freq = config.freq_rx * (1.0f + config.freq_ppm / 1000000.0f);
    char cmd[80];
    sprintf(cmd, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%04d,%01d,%04d\r\n",
            config.band, rf_freq, rf_freq, 0, config.sql_level, 0);
    return SA8x8_RunCommand(cmd);
}

String RF_SA8x8_WriteVolume()
{
     String data;
    String rsp = "\r\n";

    // AT+DMOCONNECT required before other commands — without it SA818 returns +DMOERROR
    while (SerialRF.available()) SerialRF.read(); // flush stale bytes
    SerialRF.printf("AT+DMOCONNECT\r\n");
    if (!SA8x8_waitResponse(data, rsp, 1500))
        return "Connection error to SA8x8";
    { String e = SA8x8_checkType(); if (e.length()) return e; }
    char cmd[40];
    sprintf(cmd, "AT+DMOSETVOLUME=%d\r\n", config.volume);
    return SA8x8_RunCommand(cmd);
}

String RF_SA8x8_WriteFilters()
{
    String data;
    String rsp = "\r\n";
    // AT+DMOCONNECT required before other commands — without it SA818 returns +DMOERROR
    while (SerialRF.available()) SerialRF.read(); // flush stale bytes
    SerialRF.printf("AT+DMOCONNECT\r\n");
    if (!SA8x8_waitResponse(data, rsp, 1500))
        return "Connection error to SA8x8";
    { String e = SA8x8_checkType(); if (e.length()) return e; }
    char cmd[40];
    // SA818: 0=filter enabled, 1=filter disabled (inverted vs UI bit)
    sprintf(cmd, "AT+SETFILTER=%d,%d,%d\r\n",
            (config.rf_filters & 0x01) ? 0 : 1,
            (config.rf_filters & 0x02) ? 0 : 1,
            (config.rf_filters & 0x04) ? 0 : 1);
    return SA8x8_RunCommand(cmd);
}
// ────────────────────────────────────────────────────────────────────────────

void RF_MODULE_SLEEP()
{
    digitalWrite(config.rf_pwr_gpio, !config.rf_pwr_active);
    digitalWrite(config.rf_pd_gpio, LOW);
    // PMU.disableDC3();
}

String hexToString(String hex)
{ // for String to HEX conversion
    String text = "";
    for (int k = 0; k < hex.length(); k++)
    {
        if (k % 2 != 0)
        {
            char temp[3];
            sprintf(temp, "%c%c", hex[k - 1], hex[k]);
            int number = (int)strtol(temp, NULL, 16);
            text += char(number);
        }
    }
    return text;
}


// Hardware-only init: power on module and init serial — no AT commands sent.
// Called at boot so Apply Change (RF_MODULE false) can use the serial port later.
void RF_HW_INIT()
{
    if (!config.rf_en || config.rf_type == RF_NONE) return;
    if (config.rf_rx_gpio == -1 || config.rf_tx_gpio == -1 || config.rf_pd_gpio == -1) return;

    pinMode(config.rf_pwr_gpio, OUTPUT);
    digitalWrite(config.rf_pwr_gpio, !config.rf_pwr_active); // PWR OFF
    pinMode(config.rf_pd_gpio, OUTPUT);
    digitalWrite(config.rf_pd_gpio, !config.rf_pd_active);   // PD LOW
    delay(500);
    SerialRF.begin(config.rf_baudrate, EspSoftwareSerial::SWSERIAL_8N1, config.rf_rx_gpio, config.rf_tx_gpio);
    SerialRF.setTimeout(10);
    digitalWrite(config.rf_pd_gpio, config.rf_pd_active);    // PD HIGH
    delay(1000);
    while (SerialRF.available()) SerialRF.read();             // flush startup bytes
    log_d("RF Module %s powered on — configure via Apply Change", RF_TYPE[config.rf_type]);
    Serial.printf("[RF] Module powered on. Press Apply Change to configure.\r\n");
}

void RF_MODULE(bool boot)
{
    String data;
    if (config.rf_en == false)
    {
        RF_MODULE_SLEEP();
        return;
    }
    if (config.rf_type == RF_NONE)
        return;

    if (config.rf_rx_gpio == -1 || config.rf_tx_gpio == -1 || config.rf_pd_gpio == -1)
    {
        log_d("FAIL! RF Module not config gpio");
        return;
    }
    log_d("RF Module %s Init", RF_TYPE[config.rf_type]);

    if (boot)
    {
        // Full init: disable ADC, power-cycle module, init serial
        adcEn = -1;
        dacEn = -1;
        pinMode(config.rf_pwr_gpio, OUTPUT);
        digitalWrite(config.rf_pwr_gpio, !config.rf_pwr_active); // RF POWER OFF
        pinMode(config.rf_pd_gpio, OUTPUT);
        digitalWrite(config.rf_pd_gpio, !config.rf_pd_active);   // PD LOW
        delay(500);
        SerialRF.begin(config.rf_baudrate, EspSoftwareSerial::SWSERIAL_8N1, config.rf_rx_gpio, config.rf_tx_gpio);
        SerialRF.setTimeout(10);
        digitalWrite(config.rf_pd_gpio, config.rf_pd_active);    // PD HIGH
        delay(1000);
    }
    else
    {
        // Reconfigure only: flush serial buffer, keep module and ADC running.
        // Power-cycling during Apply would pull SQL low → sqlActiveOld transition
        // → AFSK_TimerEnable(false) called after adcEn=1 restart → permanent RX loss.

