yo3gwm/ESP32APRS_Audio/src/main.cpp
        // Wait for any ongoing TX to finish before AT commands (max 5s)
        if (pttActiveSince > 0 || hw_afsk_dac_isr)
        {
            Serial.printf("[RF] Waiting for TX to finish before module reconfigure...\r\n");
            unsigned long waitStart = millis();
            while ((pttActiveSince > 0 || hw_afsk_dac_isr) && (millis() - waitStart) < 5000)
                delay(50);
            if (pttActiveSince > 0 || hw_afsk_dac_isr)
            {
                Serial.printf("[RF] TX still active after 5s, forcing PTT off\r\n");
                setPtt(false);
                pttOff = false;
            }
        }

        // Block new TX for the duration of the AT command session
        AFSK_SetTxInhibit(true);

        while (SerialRF.available()) SerialRF.read();
        delay(100);
    }

    SerialRF.write("\r\n");

    char str[200];
    String rsp = "\r\n";
    if (config.sql_level > 8)
        config.sql_level = 8;

    // PPM correction: corrected = nominal × (1 + ppm/1e6)
    float rf_freq = config.freq_rx * (1.0f + config.freq_ppm / 1000000.0f);

    // esp_task_wdt_reset();
    if ((config.rf_type == RF_SR_1WV) || (config.rf_type == RF_SR_1WU) || (config.rf_type == RF_SR_1W350))
    {
        SerialRF.printf("AT+DMOCONNECT\r\n");
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        RF_VERSION = FRS_getVERSION();
        log_d("RF Module Version %s", RF_VERSION);
        sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%d,%01d,%d,0", config.band, rf_freq, rf_freq, 0, config.sql_level, 0);
        SerialRF.println(str);
        log_d("Write to SR_FRS: %s", str);
        if (SA8x8_waitResponse(data, rsp, 4000))
            log_d("%s", data.c_str());
        // Module auto power save setting
        SerialRF.printf("AT+DMOAUTOPOWCONTR=1\r\n");
        if (SA8x8_waitResponse(data, rsp, 4000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOSETVOX=0\r\n");
        if (SA8x8_waitResponse(data, rsp, 4000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOSETMIC=6,0\r\n");
        if (SA8x8_waitResponse(data, rsp, 4000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
        if (SA8x8_waitResponse(data, rsp, 4000))
            log_d("%s", data.c_str());
    }
    else if ((config.rf_type == RF_SA8x8_VHF) || (config.rf_type == RF_SA8x8_UHF) || (config.rf_type == RF_SA8x8_350))
    {
        SerialRF.printf("AT+DMOCONNECT\r\n");
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        RF_VERSION = SA8x8_getVERSION();
        log_d("RF Module Version %s", RF_VERSION);
        sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%04d,%01d,%04d\r\n", config.band, rf_freq, rf_freq, 0, config.sql_level, 0);
        SerialRF.print(str);
        log_d("Write to SA8x8: %s", str);
        if (SA8x8_waitResponse(data, rsp, 2000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+SETTAIL=0\r\n");
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        // SA818 filter logic: 0=enabled, 1=disabled (inverted vs UI)
        SerialRF.printf("AT+SETFILTER=%d,%d,%d\r\n",
            (config.rf_filters & 0x01) ? 0 : 1,  // bit0: pre/de-emphasis
            (config.rf_filters & 0x02) ? 0 : 1,  // bit1: high pass
            (config.rf_filters & 0x04) ? 0 : 1); // bit2: low pass
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
    }
    else if ((config.rf_type == RF_SR_2WVS) || (config.rf_type == RF_SR_2WUS))
    {
        uint8_t flag = 0;  // Bit0:busy lock 0:OFF,1:ON Bit1:band 0:Wide,1:Narrow
        uint8_t flag1 = 0; // Bit0: Hi/Lo 0:2W,1:0.5W  Bit1:Middle 0:2W/0.5W 1:1W
        RF_VERSION = FRS_getVERSION();
        log_d("RF Module Version %s", RF_VERSION.c_str());

        // CTCSS always disabled for APRS — 0xFF 0xFF = off
        String tone_rx = hexToString("FF") + hexToString("FF");
        String tone_tx = hexToString("FF") + hexToString("FF");

        if (config.band == 0)
            flag |= 0x02;
        if (config.rf_power == 0)
            flag1 |= 0x02;
        sprintf(str, "AT+DMOGRP=%0.5f,%0.5f,%s,%s,%d,%d\r\n", rf_freq, rf_freq, tone_rx.c_str(), tone_tx.c_str(), flag, flag1);
        log_d("Write to SR_FRS_2W: %s", str);
        SerialRF.print(str);

        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOSAV=1\r\n");
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOVOL=%d\r\n", config.volume);
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOVOX=0\r\n");
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
        SerialRF.printf("AT+DMOFUN=%d,5,1,0,0\r\n", config.sql_level);
        if (SA8x8_waitResponse(data, rsp, 1000))
            log_d("%s", data.c_str());
    }
    delay(1);
    if (boot)
    {
        // Re-enable ADC only if we disabled it at the start (boot path only)
        adcEn = 1;
        dacEn = -1;
    }
    else
    {
        // Release TX inhibit set at the start of the Apply reconfigure path
        AFSK_SetTxInhibit(false);
    }
}

void RF_MODULE_CHECK()
{
    while (SerialRF.available() > 0)
        SerialRF.read();
    SerialRF.println("AT+DMOCONNECT");
    delay(100);
    if (SerialRF.available() > 0)
    {
        String ret = SerialRF.readString();
        if (ret.indexOf("DMOCONNECT") > 0)
        {
            SA818_Timeout = millis();
            // Serial.println(SerialRF.readString());
            log_d("RF Module %s Activate", RF_TYPE[config.rf_type]);
        }
    }
    else
    {
        log_d("RF Module %s sleep", RF_TYPE[config.rf_type]);
        digitalWrite(config.rf_pwr_gpio, !config.rf_pwr_active);
        digitalWrite(config.rf_pd_gpio, LOW);
        delay(500);
        RF_MODULE(true);
    }
}

WiFiClient aprsClient;

