yo3gwm/ESP32APRS_Audio/src/main.cpp
    if (!LITTLEFS.exists("/default.cfg"))
    {
        log_d("Factory Default");
        defaultConfig();
        saveConfiguration("/default.cfg", config);
    }
    else
    {
        if (!loadConfiguration("/default.cfg", config))
            defaultConfig();
    }

    //setCpuFrequencyMhz(config.cpuFreq);

    LED_Status(255, 255, 255);

#if defined(CONFIG_IDF_TARGET_ESP32S3)
    if ((config.rf_ptt_gpio > 25) && (config.rf_ptt_gpio < 38))
        config.rf_ptt_gpio = 5; // GPIO25-37 are flash only on ESP32S3
#endif

    if (config.i2c1_enable)
    {
        Wire1.begin(config.i2c1_sda_pin, config.i2c1_sck_pin, config.i2c1_freq);
    }

#ifdef OLED
    if (config.oled_enable)
    {
        i2c_busy = true;
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
// by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
// display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false); // initialize with the I2C addr 0x3C (for the 128x64)
#ifdef SH1106
        display.begin(SH1106_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1);
#else
        display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1, false);
#endif
        // Initialising the UI will init the display too.
        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(WHITE);

        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.setCursor(0, 15);
        display.print("APRS");
        display.setCursor(60, 32);
        display.print("AUDIO");
        display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
        display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

        display.setFont();
        display.setTextColor(WHITE);

        display.setCursor(60, 40);
        display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
        display.setCursor(65, 5);
        display.print("Copy@2022");
        display.display();
        LED_Status(255, 0, 0);
        delay(1000);
        // digitalWrite(LED_TX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("3 Sec");
        display.display();
        LED_Status(0, 255, 0);
        delay(1000);
        // digitalWrite(LED_RX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("2 Sec");
        display.display();
        LED_Status(0, 0, 255);
        delay(1000);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("1 Sec");
        display.display();
        LED_Status(0, 0, 0);
        i2c_busy = false;
    }
    else
    {
        LED_Status(200, 0, 0);
        delay(1000);
        LED_Status(0, 200, 0);
        delay(1000);
        LED_Status(0, 0, 200);
        delay(1000);
    }
#else
    if (config.i2c_enable)
    {
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
    }
    LED_Status(200, 0, 0);
    delay(1000);
    LED_Status(0, 200, 0);
    delay(1000);
    LED_Status(0, 0, 200);
    delay(1000);
#endif

    if (digitalRead(BOOT_PIN) == LOW)
    {
        defaultConfig();
        Serial.println("Manual Default configure!");
#ifdef OLED
        display.clearDisplay();
        display.setCursor(10, 22);
        display.print("Factory Reset!");
        display.display();
#endif
        while (digitalRead(BOOT_PIN) == LOW)
        {
            delay(500);
            LED_Status(0, 0, 0);
            delay(500);
            LED_Status(255, 255, 255);
        }
    }
    LED_Status(0, 0, 0);

    // if (config.counter0_enable)
    // {
    //     pcnt_init_channel(PCNT_UNIT_0, config.counter0_gpio, config.counter0_active); // Initialize Unit 0 to pin 4
    // }
    // if (config.counter1_enable)
    // {
    //     pcnt_init_channel(PCNT_UNIT_1, config.counter1_gpio, config.counter1_active); // Initialize Unit 0 to pin 4
    // }
#if ARDUINO_USB_MODE
    Serial.begin(115200);
#endif

    if (config.uart0_enable)
    {
        pinMode(config.uart0_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
        pinMode(config.uart0_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
        Serial0.begin(config.uart0_baudrate, SERIAL_8N1, config.uart0_rx_gpio, config.uart0_tx_gpio);
    }
    if (config.uart1_enable)
    {
        pinMode(config.uart1_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
        pinMode(config.uart1_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
        Serial1.begin(config.uart1_baudrate, SERIAL_8N1, config.uart1_rx_gpio, config.uart1_tx_gpio);
    }
#if SOC_UART_NUM > 2
    if(config.uart2_enable && config.uart2_baudrate > 0)
    {
    pinMode(config.uart2_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
    pinMode(config.uart2_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
    Serial2.begin(config.uart2_baudrate, SERIAL_8N1, config.uart2_rx_gpio, config.uart2_tx_gpio);
    }
#endif
    log_d("MODBUS config");
    if (config.modbus_enable)
    {
        if (config.modbus_channel == 1)
        {
            modbus.begin(config.modbus_address, Serial);
        }
        else if (config.modbus_channel == 2)
        {
            modbus.begin(config.modbus_address, Serial1);
        }
#ifdef __XTENSA__
        else if (config.modbus_channel == 3)
        {
            modbus.begin(config.modbus_address, Serial2);
        }
#endif
        if (config.modbus_channel > 0 && config.modbus_channel < 4)
        {
            // Modbus slave ID 1
            if (config.modbus_de_gpio > -1)
            {
                pinMode(config.modbus_de_gpio, OUTPUT);
                // Callbacks allow us to configure the RS485 transceiver correctly
                modbus.preTransmission(preTransmission);
                modbus.postTransmission(postTransmission);
            }
        }
    }

    log_d("RF Module hardware init");
    delay(10);

    if (config.rf_en)
        RF_HW_INIT(); // power on + serial init only — AT commands sent only on Apply Change
    log_d("Free heap: %d", ESP.getHeapSize());

