yo3gwm/ESP32APRS_Audio/src/main.cpp
#ifdef OLED
    if (config.oled_enable == true)
    {
        display.clearDisplay();
        display.setTextSize(1);
        display.display();
    }
#endif

    showDisp = true;
    if (curTab > 7)
        curTab = 6;
    oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    // enableLoopWDT();
    // enableCore0WDT();
    // enableCore1WDT();
    // disableCore1WDT();
    //      esp_task_wdt_config_t twdt_config = {
    //         .timeout_ms = 3000,                             // 3 seconds
    //         .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Bitmask of all cores
    //         .trigger_panic = false,
    //     };
    //     //#if !defined(CONFIG_IDF_TARGET_ESP32C6)
    //     esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
    // // #else
    // //     esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
    // // #endif
    //     esp_task_wdt_add(NULL);

    oledSleepTimeout = millis() + (config.oled_timeout * 1000);
    AFSKInitAct = false;
    log_d("GNSS config");
    if (config.gnss_enable)
    {
        if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
        {
            if (strstr("AT", config.gnss_at_command) != NULL)
            {
                if (config.gnss_channel == 1)
                {
                    Serial0.println(config.gnss_at_command);
                }
                else if (config.gnss_channel == 2)
                {
                    Serial1.println(config.gnss_at_command);
                }
#if SOC_UART_NUM > 2
                else if (config.gnss_channel == 3)
                {
                    Serial2.println(config.gnss_at_command);
                }
#endif
            }
        }
    }
    psramMutex = xSemaphoreCreateMutex();

    cpu_load_init(); // register idle hooks before tasks start
    log_d("Start Task");
#ifdef __XTENSA__
    // if (config.wifi_mode != 0)
    //{
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        12000,              /* Stack size in words */
        NULL,               /* Task input parameter */
        1,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        1);                 /* Core where the task should run */
    //}
    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        4096,                /* Stack size in words (increased: gap detector uses Serial.printf) */
        NULL,                /* Task input parameter */
        12,                  /* Above async_tcp(10): audio must never be starved by web server */
        &taskAPRSPollHandle, /* Task handle. */
        1);                  /* Core where the task should run */
    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
#if (CORE_DEBUG_LEVEL > 0)
        8192,            /* Stack size in words (debug) */
#else
        4096,            /* Stack size in words */
#endif
        NULL,            /* Task input parameter */
        11,              /* Above async_tcp(10): packet processing not blocked by web server */
        &taskAPRSHandle, /* Task handle. */
        1);              /* Core where the task should run */
#else
    // if (config.wifi_mode != 0)
    //{
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        #if (CORE_DEBUG_LEVEL > 0)
        8192,            /* Stack size in words */
        #else
        6200,            /* Stack size in words */
        #endif
        NULL,               /* Task input parameter */
        1,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        0);                 /* Core where the task should run */
    //}

    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        4096,                /* Stack size in words (increased: gap detector uses Serial.printf) */
        NULL,                /* Task input parameter */
        0,                   /* Priority of the task */
        &taskAPRSPollHandle, /* Task handle. */
        0);                  /* Core where the task should run */

    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        #if (CORE_DEBUG_LEVEL > 0)
        8192,            /* Stack size in words */
        #else
        4096,            /* Stack size in words */
        #endif
        NULL,            /* Task input parameter */
        2,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        0);              /* Core where the task should run */
#endif

    if (config.gnss_enable)
    {
        xTaskCreatePinnedToCore(
            taskGPS,        /* Function to implement the task */
            "taskGPS",      /* Name of the task */
            3072,           /* Stack size in words */
            NULL,           /* Task input parameter */
            4,              /* Priority of the task */
            &taskGPSHandle, /* Task handle. */
            0);             /* Core where the task should run */
    }

    if (config.ext_tnc_enable)
    {
        xTaskCreatePinnedToCore(
            taskSerial,        /* Function to implement the task */
            "taskSerial",      /* Name of the task */
            2048,              /* Stack size in words */
            NULL,              /* Task input parameter */
            5,                 /* Priority of the task */
            &taskSerialHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

    bool SensorEn = false;
    for (int i = 0; i < SENSOR_NUMBER; i++)
    {
        if (config.sensor[i].enable)
        {
            SensorEn = true;
            break;
        }
    }

    if (SensorEn == true)
    {
        xTaskCreatePinnedToCore(
            taskSensor,        /* Function to implement the task */
            "taskSensor",      /* Name of the task */
            4096,              /* Stack size in words */
            NULL,              /* Task input parameter */
            6,                 /* Priority of the task */
            &taskSensorHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

    upTimeStamp = millis() / 1000;
    autoResetTimeout = millis() + ((long)config.reset_timeout * 60000);
}

String getTimeStamp()
{
    char strtmp[50];
    time_t now;
    time(&now);
    struct tm *info = gmtime(&now);
    sprintf(strtmp, "%02d%02d%02dz", info->tm_mday, info->tm_hour, info->tm_min);
    return String(strtmp);
}

int pkgCount = 0;

float conv_coords(float in_coords)
{
    // Initialize the location.
    float f = in_coords;
    // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
    // firsttowdigits should be 77 at this point.
    int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
    float nexttwodigits = f - (float)(firsttwodigits * 100);
    float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
    return theFinalAnswer;
}

void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
{
    DD_DDDDD = abs(DD_DDDDD);
    *DD = (int)DD_DDDDD;
    *MM = (int)((DD_DDDDD - *DD) * 60);
    *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100;
}

String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)
{
    String str_comp = "";
    // String lat, lon;
    // lat = deg2lat(nowLat);
    // lon = deg2lon(nowLng);
    char lat[15], lon[15];
    memset(lat, 0, sizeof(lat));
    memset(lon, 0, sizeof(lon));
    deg2lat(lat, nowLat);
    deg2lon(lon, nowLng);
    // ESP_LOGE("GPS", "Aprs Compress");
    //  Translate from semicircles to Base91 format
    char aprs_position[15];
    long latitude = semicircles(lat, (nowLat < 0));
    long longitude = semicircles(lon, (nowLng < 0));
    long ltemp = 1073741824L - latitude; // 90 degrees - latitude
    // ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
    memset(aprs_position, 0, sizeof(aprs_position));

