yo3gwm/ESP32APRS_Audio/src/main.cpp
        if (config.wx_ssid == 0)
            sprintf(strtmp, "%s>APE32A", config.wx_mycall);
        else
            sprintf(strtmp, "%s-%d>APE32A", config.wx_mycall, config.wx_ssid);
        tnc2Raw = String(strtmp);
        free(strtmp);
    }

    if (config.wx_path < 5)
    {
        if (config.wx_path > 0)
            tnc2Raw += "-" + String(config.wx_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.wx_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    char WxRaw[500];
    memset(WxRaw, 0, 500);
    getRawWx(&WxRaw[0]);
    tnc2Raw += String(WxRaw);
    tnc2Raw += comment + String(config.wx_comment);
    return tnc2Raw;
}

int packet2Raw(String &tnc2, AX25Msg &Packet)
{
    if (Packet.len < 1)
        return 0;
    tnc2 = String(Packet.src.call);
    if (Packet.src.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.src.ssid);
    }
    tnc2 += String(F(">"));
    tnc2 += String(Packet.dst.call);
    if (Packet.dst.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.dst.ssid);
    }
    for (int i = 0; i < Packet.rpt_count; i++)
    {
        if (i >= 8)
            break;
        tnc2 += String(",");
        tnc2 += String(Packet.rpt_list[i].call);
        if (Packet.rpt_list[i].ssid > 0)
        {
            tnc2 += String("-");
            tnc2 += String(Packet.rpt_list[i].ssid);
        }
        if (Packet.rpt_flags & (1 << i))
            tnc2 += "*";
    }
    tnc2 += String(F(":"));
    tnc2 += String((const char *)Packet.info);

    return tnc2.length();
}

long sendTimer = 0;
int btn_count = 0;
long timeCheck = 0;
int timeHalfSec = 0;

unsigned long timeTask;
unsigned long timeSec;
char nmea[100];
int nmea_idx = 0;
bool save_mode = false;
bool save_act = false;
bool manualWiFi = false;

void msgBox(String msg)
{
#ifdef OLED
    int x = msg.length() * 6;
    int x1 = (SCREEN_WIDTH / 2) - (x / 2);
    int y1 = (SCREEN_HEIGHT / 2);

    display.fillRect(x1 - 7, y1 - 6, x + 14, 28, BLACK);
    display.drawRect(x1 - 5, y1 - 4, x + 10, 24, WHITE);
    display.drawLine(x1 - 3, y1 + 21, x1 + (x + 10) - 4, y1 + 21, WHITE);
    display.drawLine(x1 + (x + 10) - 4, y1 - 2, x1 + (x + 10) - 4, y1 + 21, WHITE);
    display.setCursor(x1, y1 + 5);
    display.print(msg);
    display.display();
#endif
}

void loop()
{
    if (millis() > timeTask)
    {
        timeTask = millis() + 10000;
        unsigned long upT = (millis() / 1000) - upTimeStamp;
        convertSecondsToDHMS(nmea, upT);
        log_d("Task process APRS=%iuS\t NETWORK=%iuS\t GPS=%iuS\t SERIAL=%iuS\n", timerAPRS, timerNetwork, timerGPS, timerSerial);
        log_d("upTime %s Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm", nmea, String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str());
    }

    vTaskDelay(10 / portTICK_PERIOD_MS);

    // if (digitalRead(BOOT_PIN) == LOW)
    // {
    //     btn_count++;
    //     if (btn_count > 1000) // Push BOOT 10sec
    //     {
    //         digitalWrite(LED_RX_PIN, HIGH);
    //         digitalWrite(LED_TX_PIN, HIGH);
    //     }
    // }
    // else
    // {
    //     if (btn_count > 0)
    //     {
    //         // Serial.printf("btn_count=%dms\n", btn_count * 10);
    //         if (btn_count > 1000) // Push BOOT 10sec to Factory Default
    //         {
    //             // digitalWrite(LED_RX, LOW);
    //             // digitalWrite(LED_TX, LOW);
    //             defaultConfig();
    //             log_d("SYSTEM REBOOT NOW!");
    //             esp_restart();
    //         }
    //         else
    //         {
    //             showDisp = true;
    //             timeSec = timeHalfSec = millis();
    //             // if (oledSleepTimeout > 0)
    //             //{
    //             curTab++;
    //             if (curTab > 3)
    //                 curTab = 0;
    //             //}
    //         }
    //         btn_count = 0;
    //     }
    // }
    if (digitalRead(BOOT_PIN) == LOW)
    {
        btn_count++;
        if (btn_count > 200) // Push BOOT >2sec
        {
            btn_count = 0;
            if (curTab == 0)
            {
                showDisp = true;
                timeSec = timeHalfSec = millis();
                if (gps_mode)
                    gps_mode = false;
                else
                    gps_mode = true;
                msgBox("GPS SWAP");
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
            }
            else if (curTab == 4) // System display
            {
                msgBox("POWER OFF");
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
                // PowerOff();
                esp_deep_sleep_start();
            }
            else if (curTab == 6) // Wifi display
            {
                if (manualWiFi)
                {
                    manualWiFi = false;
                    msgBox("WiFi OFF");
                    vTaskSuspend(taskNetworkHandle);
                    WiFi.disconnect(true); // Disconnect from the network
                    WiFi.persistent(false);
                    WiFi.mode(WIFI_OFF); // Switch WiFi off
                }
                else
                {
                    manualWiFi = true;
                    msgBox("WiFi ON");
                    vTaskResume(taskNetworkHandle);
                }
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
            }
            else if (curTab == 1) // Status display
            {
                msgBox("MANUAL TX");
                while (digitalRead(BOOT_PIN) == LOW)
                {
                    delay(100);
                }
                EVENT_TX_POSITION = 6;
                tx_interval = config.trk_interval;
            }
        }
        else
        {
        }
    }
    else
    {
        if (btn_count > 0)
        {
            log_d("btn_count=%d", btn_count);
            if (btn_count > 25) // Push BOOT 10sec to Factory Default
            {
                // digitalWrite(LED_RX, LOW);
                // digitalWrite(LED_TX, LOW);
                // defaultConfig();
                // log_d("SYSTEM REBOOT NOW!");
                // esp_restart();
            }
            else
            {
                StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                if (save_mode)
                    save_act = true;
                showDisp = true;
                timeSec = timeHalfSec = millis();
                // if (oledSleepTimeout > 0)
                //{
                curTab++;
                if (curTab > 7)
                    curTab = 0;
                //}
                log_d("curTab=%d", curTab);
            }
        }
        btn_count = 0;
    }

