yo3gwm/ESP32APRS_Audio/src/main.cpp
void taskSerial(void *pvParameters)
{
    String raw;
    int c;
    char rawP[500];
    char call[11];
    log_d("Serial task Init");
    nmea_idx = 0;
    if (config.ext_tnc_enable)
    {
        if (config.ext_tnc_channel == 1)
        {

#if ARDUINO_USB_MODE
            Serial.setTimeout(10);
#endif
        }
        else if (config.ext_tnc_channel == 2)
        {
            Serial1.setTimeout(10);
        }
        else if (config.ext_tnc_channel == 3)
        {
            // Serial2.setTimeout(10);
        }
    }
    if (config.wx_en)
    {
        //         if (config.wx_channel == 1)
        //         {
        // #if ARDUINO_USB_CDC_ON_BOOT
        //             Serial0.setTimeout(10);
        // #else
        //             Serial.setTimeout(10);
        // #endif
        //         }
        //         else if (config.wx_channel == 2)
        //         {
        //             Serial1.setTimeout(10);
        //         }
        //         else if (config.wx_channel == 3)
        //         {
        //             // Serial2.setTimeout(10);
        //         }
    }
    for (;;)
    {
        timerSerial = millis() - timerSerial_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerSerial_old = micros();

        if (config.wx_en)
        {
            //             if (config.wx_channel > 0 && config.wx_channel < 4)
            //             {
            //                 String wx = "";
            //                 if (config.wx_channel == 1)
            //                 {
            // #if ARDUINO_USB_CDC_ON_BOOT
            //                     wx = Serial.readString();
            // #else
            //                     wx = Serial.readString();
            // #endif
            //                 }
            //                 else if (config.wx_channel == 2)
            //                 {
            //                     wx = Serial1.readString();
            //                 }
            //                 else if (config.wx_channel == 3)
            //                 {
            //                     // wx = Serial2.readString();
            //                 }
            //                 // if (wx!="")
            //                 //{
            //                 // while (SerialWX->available())
            //                 //{
            //                 // String wx = SerialWX->readString();
            //                 if (wx != "" && wx.indexOf("DATA:") >= 0)
            //                 {
            //                     log_d("WX Raw >> %d", wx.c_str());
            //                     getCSV2Wx(wx);
            //                 }
            //                 //}
            //                 //}
            //             }
            // else if(config.wx_channel == 4){
            //     bool result=getM702Modbus(modbus);
            // }
        }

        if (config.ext_tnc_enable && (config.ext_tnc_mode > 0 && config.ext_tnc_mode < 5))
        {
            if (config.ext_tnc_mode == 1)
            { // KISS
                // KISS MODE
                do
                {
                    c = -1;
                    if (config.ext_tnc_channel == 1)
                    {
                        if (Serial0.available()) c = Serial0.read();
                    }
                    else if (config.ext_tnc_channel == 2)
                    {
                        if (Serial1.available()) c = Serial1.read();
                    }
#if SOC_UART_NUM > 2
                    else if (config.ext_tnc_channel == 3)
                    {
                        if (Serial2.available()) c = Serial2.read();
                    }
#endif
                    else if (config.ext_tnc_channel == 4)
                    {
                        if (Serial.available()) c = Serial.read();
                    }

                    if (c > -1)
                        kiss_serial((uint8_t)c);
                    else
                        break;
                } while (c > -1);
            }
            else if (config.ext_tnc_mode == 2)
            { // TNC2RAW
                raw.clear();
                if (config.ext_tnc_channel == 1)
                {
                    if (Serial0.available())
                        raw = Serial0.readStringUntil(0x0D);
                }
                else if (config.ext_tnc_channel == 2)
                {
                    if (Serial1.available())
                        raw = Serial1.readStringUntil(0x0D);
                }
#if SOC_UART_NUM > 2
                else if (config.ext_tnc_channel == 3)
                {
                    if (Serial2.available())
                        raw = Serial2.readStringUntil(0x0D);
                }
#endif
                else if (config.ext_tnc_channel == 4)
                {
                    if (Serial.available())
                        raw = Serial.readStringUntil(0x0D);
                }

                log_d("Ext TNC2RAW RX:%s", raw.c_str());
                String src_call = raw.substring(0, raw.indexOf('>'));
                if ((src_call != "") && (src_call.length() < 10) && (raw.length() < sizeof(rawP)))
                {
                    memset(call, 0, sizeof(call));
                    strcpy(call, src_call.c_str());
                    strcpy(rawP, raw.c_str());
                    uint16_t type = pkgType((const char *)rawP);
                    pkgListUpdate(call, rawP, type, 1, -1);
                    if (config.rf2inet && aprsClient.connected())
                    {
                        // RF->INET
                        aprsClient.write(&rawP[0], strlen(rawP)); // Send binary frame packet to APRS-IS (aprsc)
                        aprsClient.write("\r\n");                 // Send CR LF the end frame packet
                        status.rf2inet++;
                        // igateTLM.RF2INET++;
                        // igateTLM.RX++;
                    }
                }
            }
            else if (config.ext_tnc_mode == 3)
            { // YAESU FTM-350,FTM-400
                String info = "";
                if (config.ext_tnc_channel == 1)
                {
                    if (Serial0.available())
                        info = Serial0.readStringUntil(0x0D);
                }
                else if (config.ext_tnc_channel == 2)
                {
                    if (Serial1.available())
                        info = Serial1.readStringUntil(0x0D);
                }
#if SOC_UART_NUM > 2
                else if (config.ext_tnc_channel == 3)
                {
                    if (Serial2.available())
                        info = Serial2.readStringUntil(0x0D);
                }
#endif
                else if (config.ext_tnc_channel == 4)
                {
                    if (Serial.available())
                        info = Serial.readStringUntil(0x0D);
                }

