yo3gwm/ESP32APRS_Audio/src/main.cpp
                //  log_d("Ext Yaesu Packet >> %s",info.c_str());
                int ed = info.indexOf(" [");
                if (info != "" && ed > 10)
                {
                    raw.clear();
                    raw = info.substring(0, ed);
                    int st = info.indexOf(">:");
                    if (st > ed)
                    {
                        int idx = 0;
                        st += 2;
                        for (int i = 0; i < 5; i++)
                        {
                            if (info.charAt(st + i) == 0x0A || info.charAt(st + i) == 0x0D)
                            {
                                idx++;
                            }
                            else
                            {
                                break;
                            }
                        }
                        st += idx;
                        ed = info.indexOf(0x0D, st + 1);
                        if (ed > info.length())
                            ed = info.length();
                        if (ed > st)
                        {
                            raw += ":" + info.substring(st, ed);

                            String src_call = raw.substring(0, raw.indexOf('>'));
                            if ((src_call != "") && (src_call.length() < 11) && (raw.length() < sizeof(rawP)))
                            {
                                memset(call, 0, sizeof(call));
                                strcpy(call, src_call.c_str());
                                memset(rawP, 0, sizeof(rawP));
                                strcpy(rawP, raw.c_str());
                                log_d("Yaesu Packet: CallSign:%s RAW:%s", call, rawP);
                                // String hstr="";
                                // for(int i=0;i<raw.length();i++){
                                //     hstr+=" "+String(rawP[i],HEX);
                                // }
                                // log_d("HEX: %s",hstr.c_str());
                                uint16_t type = pkgType((const char *)rawP);
                                pkgListUpdate(call, rawP, type, 1, -1);
                                if (config.rf2inet && aprsClient.connected())
                                {
                                    // RF->INET
                                    aprsClient.write(&rawP[0], strlen(rawP)); // Send binary frame packet to APRS-IS (aprsc)
                                    aprsClient.write("\r\n");                 // Send CR LF the end frame packet
                                    status.rf2inet++;
                                    // igateTLM.RF2INET++;
                                    // igateTLM.RX++;
                                }
                            }
                        }
                    }
                }
            }
            //}
        }

        if (config.at_cmd_uart > 0)
        {
            if (config.at_cmd_uart == 1)
            { // UART0
                if (Serial0.available())
                {
                    String cmd = Serial0.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if (ret != "")
                        Serial0.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
            else if (config.at_cmd_uart == 2)
            { // UART1
                if (Serial1.available())
                {
                    String cmd = Serial1.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if (ret != "")
                        Serial1.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
#if SOC_UART_NUM > 2
            else if (config.at_cmd_uart == 3)
            { // UART2
                if (Serial2.available())
                {
                    String cmd = Serial2.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if (ret != "")
                        Serial2.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
#endif
            else if (config.at_cmd_uart == 4)
            { // USB-CDC
                if (Serial.available())
                {
                    String cmd = Serial.readStringUntil('\n');
                    cmd.trim();
                    String ret = handleATCommand(String((char *)cmd.c_str()));
                    if (ret != "")
                        Serial.println(ret);
                    log_d("AT-Command response: %s", ret.c_str());
                }
            }
        }
    }
}

long timeSlot;
unsigned long iGatetickInterval;
unsigned long WxInterval;
bool initInterval = true;
int trkTlmInvCount = 0;
int igateTlmInvCount = 0;
int digiTlmInvCount = 0;
unsigned long msgInterval = 0;
void taskAPRS(void *pvParameters)
{
    //	long start, stop;
    char sts[50];
    unsigned long tickInterval = 0;
    unsigned long DiGiInterval = 0;

    unsigned long igateSTSInterval = 0;
    unsigned long digiSTSInterval = 0;
    unsigned long trkSTSInterval = 0;

    uint16_t type = 0;
    bool newIGatePkg = false;
    bool newDigiPkg = false;
    uint8_t *buf;
    uint16_t size = 0;
    int8_t peak = 0;
    int8_t valley = 0;
    uint8_t signalLevel = 0;
    uint8_t fixed = 0;
    uint16_t mV = 0;

    // PacketBuffer.clean();
    adcEn = 0;
    dacEn = 0;

    APRS_setCallsign(config.aprs_mycall, config.aprs_ssid);
    sendTimer = millis() - (config.igate_interval * 1000) + 30000;
    igateTLM.TeleTimeout = millis() + 60000; // 1Min

    msgInterval = millis() + 30000;
    timeSlot = millis();
    timeAprs = 0;
    tx_interval = config.trk_interval;
    tx_counter = tx_interval - 10;

