yo3gwm/ESP32APRS_Audio/src/main.cpp
#ifdef MQTT
                    if (config.en_mqtt && clientMQTT.connected() && (config.mqtt_topic_flag & MQTT_TOPIC_TNC))
                    {
                        log_d("Publish MQTT Topic: %s Payload: %s", config.mqtt_topic, tnc2.c_str());
                        clientMQTT.publish(config.mqtt_topic, tnc2.c_str());
                    }
#endif
                    // SerialBT.println(tnc2);
                    // uint16_t type = pkgType((char *)incomingPacket.info);
                    if (!(type & FILTER_THIRDPARTY))
                    {
                        char call[11];
                        if (incomingPacket.src.ssid > 0)
                            sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
                        else
                            sprintf(call, "%s", incomingPacket.src.call);

                        // Object packets: key by object name so they get a separate pkgList
                        // slot from the source station's regular beacons.
                        // The web UI still shows "OBJ(SRC)" because it re-parses raw.
                        if (type & FILTER_OBJECT) {
                            const char *colon = strchr(tnc2.c_str(), ':');
                            if (colon && *(colon + 1) == ';') {
                                int last_nonspace = -1;
                                for (int z = 0; z < 9; z++) {
                                    char c = *(colon + 2 + z);
                                    if ((uint8_t)c < 0x20 || (uint8_t)c > 0x7E) break;
                                    if (c != ' ') last_nonspace = z;
                                }
                                if (last_nonspace >= 0) {
                                    memset(call, 0, sizeof(call));
                                    for (int z = 0; z <= last_nonspace && z < 10; z++)
                                        call[z] = *(colon + 2 + z);
                                }
                            }
                        }

                        char *rawP = (char *)calloc(tnc2.length() + 1, sizeof(char));
                        if (rawP)
                        {
                            memset(rawP, 0, tnc2.length() + 1);
                            // toCharArray(buf, len) copies only len-1 chars — use memcpy
                            memcpy(rawP, tnc2.c_str(), tnc2.length());
                            int idx = pkgListUpdate(call, rawP, type, 0, incomingPacket.mVrms);

#if defined OLED || defined ST7735_160x80
                            if ((config.oled_enable) && (idx > -1))
                            {

                                if (config.rx_display && config.dispRF && (type & config.dispFilter))
                                {
                                    dispBuffer.push(tnc2.c_str());
                                    log_d("RF_putQueueDisp:[pkgList_idx=%d,Type=%d RAW:%s] %s\n", idx, type, call, tnc2.c_str());
                                }
                            }
#endif
                            handle_ws(rawP, tnc2.length(), incomingPacket.mVrms);
                            free(rawP);
                        }
                    }
                    else if (type & FILTER_THIRDPARTY)
                    {
                        // Extract inner packet from third-party frame and store it separately
                        int cb = tnc2.indexOf(":}");
                        if (cb >= 0)
                        {
                            String inner = tnc2.substring(cb + 2); // YO8RXT-15>APOBJ,...:;...
                            int ig = inner.indexOf('>');
                            if (ig > 0 && ig < 11)
                            {
                                char inner_call[11] = {0};
                                strncpy(inner_call, inner.c_str(), ig);
                                uint16_t inner_type = type & ~FILTER_THIRDPARTY;
                                char *rawP = (char *)calloc(inner.length() + 1, sizeof(char));
                                if (rawP)
                                {
                                    memcpy(rawP, inner.c_str(), inner.length());
                                    pkgListUpdate(inner_call, rawP, inner_type, 0, incomingPacket.mVrms);
                                    handle_ws(rawP, inner.length(), incomingPacket.mVrms);
                                    free(rawP);
                                }
                            }
                        }
                    }

                    if (config.msg_enable && (type & FILTER_MESSAGE))
                    {
                        handleIncomingAPRS(tnc2);
                    }
                    lastPkg = true;
                    // handle_ws(tnc2, incomingPacket.mVrms);
                    //   ESP_BT.println(tnc2);
                    status.allCount++;

                    tnc2.clear();
                }
            }
        }

        // IGate Process
        if (config.igate_en)
        {
            if (config.igate_sts_interval > 10)
            {
                if (millis() > igateSTSInterval)
                {
                    igateSTSInterval = millis() + (config.igate_sts_interval * 1000);
                    igate_status(config.igate_status);
                }
            }
            // IGATE Position
            if (config.igate_bcn)
            {
                if (millis() > iGatetickInterval)
                {

                    String rawData = "";
                    if (config.igate_gps)
                    { // IGATE Send GPS position
                        if (gps.location.isValid())
                        {
                            rawData = igate_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                            if (config.log & LOG_IGATE)
                            {
                                logIGate(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                            }
                        }
                    }
                    else
                    { // IGATE Send fix position
                        rawData = igate_position(config.igate_lat, config.igate_lon, config.igate_alt, "");
                        if (config.log & LOG_IGATE)
                        {
                            logIGate(config.igate_lat, config.igate_lon, 0, 0);
                        }
                    }
                    if (rawData != "")
                    {
                        iGatetickInterval = millis() + (config.igate_interval * 1000);
                        Sleep_Activate &= ~ACTIVATE_IGATE;
                        StandByTick = millis() + (5000);
                        if (config.igate_tlm_interval > 0)
                        {
                            igateTlmInvCount++;
                            if (igateTlmInvCount >= config.igate_tlm_interval)
                            {
                                igateTlmInvCount = 0;
                                if (config.igate_tlm_sensor[0] | config.igate_tlm_sensor[1] | config.igate_tlm_sensor[2] | config.igate_tlm_sensor[3] | config.igate_tlm_sensor[4])
                                {
                                    char tlm_result[100];
                                    char tlm_data[200];
                                    size_t tlm_sz;
                                    if ((IGATE_TLM_SEQ % 100) == 0)
                                    {
                                        char rawInfo[100];
                                        char name[10];
                                        sprintf(rawInfo, "PARM.");
                                        int i, c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.igate_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                sprintf(name, "%s", config.igate_tlm_PARM[i]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c + 8; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                        }
                                        sendTelemetry_igate(rawInfo);
                                        memset(rawInfo, 0, sizeof(rawInfo));
                                        sprintf(rawInfo, "UNIT.");
                                        c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.igate_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                sprintf(name, "%s", config.igate_tlm_UNIT[i]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c + 8; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                        }
                                        sendTelemetry_igate(rawInfo);
                                        memset(rawInfo, 0, sizeof(rawInfo));
                                        sprintf(rawInfo, "EQNS.");
                                        c = 0;
                                        for (i = 0; i < 5; i++)
                                        {
                                            if (config.igate_tlm_sensor[i] == 0)
                                            {
                                                c++;
                                                continue;
                                            }
                                            else
                                            {
                                                if (i > 0)
                                                    strcat(rawInfo, ",");
                                                if (fmod(config.igate_tlm_EQNS[i][0], 1) == 0)
                                                    sprintf(name, "%0.f", config.igate_tlm_EQNS[i][0]);
                                                else
                                                    sprintf(name, "%.3f", config.igate_tlm_EQNS[i][0]);
                                                strcat(rawInfo, name);
                                                if (fmod(config.igate_tlm_EQNS[i][1], 1) == 0)
                                                    sprintf(name, ",%0.f", config.igate_tlm_EQNS[i][1]);
                                                else
                                                    sprintf(name, ",%.3f", config.igate_tlm_EQNS[i][1]);
                                                strcat(rawInfo, name);
                                                if (fmod(config.igate_tlm_EQNS[i][2], 1) == 0)
                                                    sprintf(name, ",%0.f", config.igate_tlm_EQNS[i][2]);
                                                else
                                                    sprintf(name, ",%.3f", config.igate_tlm_EQNS[i][2]);
                                                strcat(rawInfo, name);
                                            }
                                        }
                                        for (int n = c; n > 0; n--)
                                        {
                                            strcat(rawInfo, ",");
                                            sprintf(name, "0");
                                            strcat(rawInfo, name);
                                            sprintf(name, ",1");
                                            strcat(rawInfo, name);
                                            sprintf(name, ",0");
                                            strcat(rawInfo, name);
                                        }
                                        // strcat(rawInfo, ",");
                                        sendTelemetry_igate(rawInfo);
                                    }

