yo3gwm/ESP32APRS_Audio/src/main.cpp
    // afskSetDCOffset(config.adc_dc_offset);
    afskSetADCAtten(config.adc_atten);
    afskSetRxLog(config.rx_log_enable);

#ifdef STRIP_PIN
    AFSK_init(config.adc_gpio, config.dac_gpio, config.rf_ptt_gpio, config.rf_sql_gpio, config.rf_pwr_gpio, -1, -1, STRIP_PIN, config.rf_ptt_active, config.rf_sql_active, config.rf_pwr_active);
#else
    AFSK_init(config.adc_gpio, config.dac_gpio, config.rf_ptt_gpio, config.rf_sql_gpio, config.rf_pwr_gpio, LED_TX_PIN, LED_RX_PIN, -1, config.rf_ptt_active, config.rf_sql_active, config.rf_pwr_active);
#endif
    setPtt(false);
    log_d("APRS Polling Task Start on Core %d.", xPortGetCoreID());
    for (;;)
    {
        if (config.modem_type == 3)
            vTaskDelay(1 / portTICK_PERIOD_MS);
        else
            vTaskDelay(3 / portTICK_PERIOD_MS);

        if (AFSKInitAct == true)
        {
            AFSK_Poll(false, LOW);
        }
    }
}

int mqttRetry = 0;
long wifiTTL = 0;

// WiFi connect timeout per AP. Increase when connecting takes longer.
const uint32_t connectTimeoutMs = 60000;
uint8_t APStationNum = 0;
unsigned long waitISRetry = 0;
unsigned long lastHeardTimeout = 0;

#ifdef PPPOS
pppType pppStatus;
long int pppTimeout = 0;
#endif

IPAddress no_ip(0, 0, 0, 0);
IPAddress ap_ip(192, 168, 4, 1);
IPAddress ap_mask(255, 255, 255, 0);
IPAddress ap_leaseStart(192, 168, 4, 2);
IPAddress ap_dns(8, 8, 4, 4);

uint8_t wifiStatus = WL_DISCONNECTED;
bool vpnConnected = false;
bool wifiDisconnecting = false;
uint16_t wifiDisCount = 0;
unsigned long vpnTimeout = 0;
unsigned long mitiWifiTimeout = 0;

// WiFi current AP tracking for stable reconnection
String currentAPSSID = "";
int8_t currentAPIndex = -1;
unsigned long lastReconnectAttempt = 0;
unsigned long lastAPCheck = 0;

void wifiConnection()
{
    // Cleanup sensor objects before WiFi reconnection to prevent memory leaks
    cleanupSensors();

    // Wait for any ongoing TX to finish before AFSK_deinit.
    // Radio has priority over WiFi reconnect — never interrupt a transmission.
    // If TX doesn't finish within 5s (watchdog handles it separately), proceed anyway.
    if (pttActiveSince > 0)
    {
        Serial.printf("[WiFi] Waiting for TX to finish before reconnect...\r\n");
        unsigned long waitStart = millis();
        while (pttActiveSince > 0 && (millis() - waitStart) < 5000)
            delay(50);
        if (pttActiveSince > 0)
        {
            // TX still stuck after 5s — force off as last resort
            Serial.printf("[WiFi] TX still active after 5s, forcing PTT off\r\n");
            setPtt(false);
            pttOff = false;
        }
        else
        {
            Serial.printf("[WiFi] TX finished, proceeding with reconnect\r\n");
        }
    }

    // Stop ADC ISR before WiFi mode changes to prevent stale/corrupt samples.
    // RF activity during WiFi init causes analogReadMilliVolts to return near-constant
    // values, filling the FIFO with flat data → mVrms≈2, dcd=0, gap for minutes.
    if (AFSKInitAct)
        AFSK_TimerEnable(false);

    // disconnect(wifioff=false) to avoid double esp_wifi_deinit with WiFi.mode(WIFI_OFF).
    // eraseap=true clears stored AP; wifioff=false keeps netif consistent.
    WiFi.disconnect(false, true);
    WiFi.persistent(false);
    WiFi.mode(WIFI_OFF); // Switch WiFi off — single clean deinit

    wifiTTL = 0;
    delay(1500); // allow netif teardown to complete before re-init
    if (config.wifi_mode == WIFI_STA_FIX)
    { /**< WiFi station mode */
        WiFi.mode(WIFI_MODE_STA);
        // WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    { /**< WiFi soft-AP mode */
        WiFi.mode(WIFI_MODE_AP);
        // WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    { /**< WiFi station + soft-AP mode */
        WiFi.mode(WIFI_MODE_APSTA);
        // WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else
    {
        WiFi.mode(WIFI_MODE_NULL);
    }
    wifiMulti.APlistClean(); // Clean AP list
    for (int i = 0; i < 5; i++)
    {
        if (config.wifi_sta[i].enable)
        {
            wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
        }
    }
    esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
    WiFi.setHostname(config.host_name);
    if (wifiMulti.run(10000) == WL_CONNECTED)
    {
        wifiDisCount = 0;
        pingTimeout = millis() + 60000;
        NTP_Timeout = millis() + 2000;

        // Track current AP for stable reconnection
        currentAPSSID = WiFi.SSID();
        currentAPIndex = -1;
        for (int i = 0; i < 5; i++)
        {
            if (config.wifi_sta[i].enable &&
                strcmp(config.wifi_sta[i].wifi_ssid, currentAPSSID.c_str()) == 0)
            {
                currentAPIndex = i;
                log_d("Connected to AP[%d]: %s", i, currentAPSSID.c_str());
                break;
            }
        }
        if(WiFi.RSSI() < -90){
            //mitiWifiTimeout = millis() + 5000;
            // Set the protocol to 802.11b and 802.11g
            esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B);
        }else if(WiFi.RSSI() < -70){
            esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G);
        }
    }

    // Restart ADC ISR with clean FIFO after WiFi operation.
    // AFSK_TimerEnable(true) calls RingBuffer_Init → discards any stale/corrupt samples
    // accumulated during WiFi mode changes. Recovery in <40ms regardless of connect result.
    if (AFSKInitAct)
        AFSK_TimerEnable(true);
}

void onEvent(arduino_event_id_t event, arduino_event_info_t info)
{
    switch (event)
    {
#ifdef PPPOS
    case ARDUINO_EVENT_PPP_START:
        log_d("PPP Started");
        break;
    case ARDUINO_EVENT_PPP_CONNECTED:
        log_d("PPP Connected");
        if (!WiFi.isConnected())
        {
            if (config.vpn)
            {
                log_d("Setup Wireguard VPN by PPP!");
                vpnConnected = false;
                vpnTimeout = millis() + 3000;
            }

