yo3gwm/ESP32APRS_Audio/src/main.cpp
        bool attached = PPP.attached();
        if (!attached)
        {
            int i = 0;
            unsigned int s = millis();
            log_d("Waiting to connect to network");
            while (!attached && ((++i) < 30))
            {
                log_d(".");
                delay(100);
                attached = PPP.attached();
            }
            log_d("%ds", (millis() - s) / 1000.0);
            attached = PPP.attached();
        }

        log_d("Attached: %d", attached);
        log_d("State: %d", PPP.radioState());
        if (attached)
        {
            sprintf(pppStatus.oper, "%s", PPP.operatorName().c_str());
            sprintf(pppStatus.imsi, "%s", PPP.IMSI().c_str());
            log_d("IMSI: %s", pppStatus.imsi);
            pppStatus.rssi = PPP.RSSI();
            log_d("Operator: %s", pppStatus.oper);
            log_d("RSSI: %d dBm", pppStatus.rssi);
            PPP.started(); // Start the PPP connection
            //   if(PPP.sms("0984958488","Test SMS from ESP32")){
            //       log_d("SMS sent successfully!");
            //   } else {
            //       log_d("Failed to send SMS.");
            //   }
            int ber = PPP.BER();
            if (ber > 0)
            {
                log_d("BER: %i", ber);
                log_d("NetMode: %i", PPP.networkMode());
            }

            log_d("Switching to data mode...");
            PPP.mode(ESP_MODEM_MODE_DATA); // Data and Command mixed mode
            if (!PPP.waitStatusBits(ESP_NETIF_CONNECTED_BIT, 5000))
            {
                log_d("Failed to connect to internet!");
                PPP.mode(ESP_MODEM_MODE_COMMAND); // Switch back to command mode
            }
            else
            {
                log_d("Connected to internet!");
            }
        }
        else
        {
            log_d("Failed to connect to network!");
        }
    }
}
#endif

void taskNetwork(void *pvParameters)
{
    int c = 0;
    // char raw[500];
    log_d("Task Network has been start");
    // manualWiFi = true;

    // Listen for modem events
    Network.onEvent(onEvent);

    // WiFi.onEvent(Wifi_connected,SYSTEM_EVENT_STA_CONNECTED);
    // WiFi.onEvent(Get_IPAddress, SYSTEM_EVENT_STA_GOT_IP);
    // WiFi.onEvent(Wifi_disconnected, SYSTEM_EVENT_STA_DISCONNECTED);

    if (config.wifi_mode == WIFI_STA_FIX)
    { /**< WiFi station mode */
        WiFi.mode(WIFI_MODE_STA);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    { /**< WiFi soft-AP mode */
        WiFi.mode(WIFI_MODE_AP);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    { /**< WiFi station + soft-AP mode */
        WiFi.mode(WIFI_MODE_APSTA);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else
    {
        WiFi.mode(WIFI_MODE_NULL);
    }

    if (config.wifi_mode & WIFI_STA_FIX)
    {
        // for (int i = 0; i < 5; i++)
        // {
        //     if (config.wifi_sta[i].enable)
        //     {
        //         wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
        //     }
        // }
        // WiFi.setHostname(config.host_name);
        // if (wifiMulti.run() == WL_CONNECTED)
        // {
        //     NTP_Timeout = millis() + 2000;
        // }
        wifiConnection();

        wifiMulti.setStrictMode(true); // Default is true.  Library will disconnect and forget currently connected AP if it's not in the AP list.
        wifiMulti.setAllowOpenAP(false); // Default is false.  True adds open APs to the AP list.
    }

    if (config.wifi_mode & WIFI_AP_FIX)
    {
        // manualWiFi = true;
        log_d("Access point running. IP address: ");
        log_d("%s", WiFi.softAPIP().toString().c_str());
        // Start the Access Point
        WiFi.AP.begin();
        WiFi.AP.config(ap_ip, ap_ip, ap_mask, ap_leaseStart, ap_dns);
        WiFi.AP.create(config.wifi_ap_ssid, config.wifi_ap_pass);
        if (!WiFi.AP.waitStatusBits(ESP_NETIF_STARTED_BIT, 1000))
        {
            Serial.println("Failed to start AP!");
            // return;
        }
    }

    pingTimeout = millis() + 10000;
    unsigned long timeNetworkOld = millis();
    timeNetwork = 0;

#ifdef PPPOS
    //Initialize pppStatus
    memset(&pppStatus, 0, sizeof(pppType));
    strcpy(pppStatus.manufacturer, "N/A");
    strcpy(pppStatus.model, "N/A");
    strcpy(pppStatus.imei, "N/A");
    strcpy(pppStatus.imsi, "N/A");
    strcpy(pppStatus.oper, "N/A");
    pppStatus.rssi= -127;
    pppStatus.ip = 0;
    pppStatus.gateway = 0;
    
    PPPOS_Start(); // Start PPP connection if enabled
    pppTimeout = millis() + (600 * 1000);
#endif

#ifdef PPPOS
    if (config.ppp_enable || (config.wifi_mode & WIFI_AP_STA_FIX))
#else
    if (config.wifi_mode & WIFI_AP_STA_FIX)
#endif
        webService();

    // wireguard_ctx_t ctx = {0};
    esp_err_t err;
    // #ifdef PPPOS
    // PPPOS_Start();    // Start PPP connection if enabled
    // #endif

#ifdef BLUETOOTH
    bluetooth_init(); // Initialize Bluetooth if enabled
#endif

    for (;;)
    {
        unsigned long now = millis();
        timeNetwork = now - timeNetworkOld;
        timeNetworkOld = now;
        // wdtNetworkTimer = millis();
        // serviceHandle();
        // esp_task_wdt_reset();
        timerNetwork = micros() - timerNetwork_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerNetwork_old = micros();

#ifdef PPPOS
        if (config.ppp_enable)
        {
            if (!PPP.connected())
            {
                if (millis() > pppTimeout)
                {
                    log_d("PPP connection timeout!");
                    PPPOS_Start(); // Restart PPP connection
                    pppTimeout = millis() + (600 * 1000);
                }
            }
        }

        if (WiFi.isConnected() == true || WiFi.softAPgetStationNum() > 0 || PPP.connected())
#else
        if (WiFi.isConnected() == true || WiFi.softAPgetStationNum() > 0)
#endif
        {
            if (lastHeard_Flag)
            {
                if (millis() > lastHeardTimeout)
                {
                    lastHeard_Flag = false;
                    lastHeardTimeout = millis() + 1000;
                    event_lastHeard(false);
                }
            }
        }

