yo3gwm/ESP32APRS_Audio/src/main.cpp
        if (config.wifi_mode & WIFI_AP_FIX)
        {
            APStationNum = WiFi.softAPgetStationNum();
            if (APStationNum > 0)
            {
// config.pwr_sleep_activate |= ACTIVATE_WIFI;
#ifdef PPPOS
                if ((WiFi.isConnected() == false) && (PPP.connected() == false))
#else
                if (WiFi.isConnected() == false)
#endif
                {
                    vTaskDelay(9 / portTICK_PERIOD_MS);
                    continue;
                }
            }
        }

        wifiStatus = WL_DISCONNECTED;
        if (config.wifi_mode & WIFI_STA_FIX)
        {
            if (WiFi.isConnected() == false)
            {
                if (millis() > mitiWifiTimeout)
                {
                    mitiWifiTimeout = millis() + 30000;
                    log_d("WiFi Check Connection!");

                    // Try to reconnect to current AP first for stability
                    if(currentAPIndex >= 0 && config.wifi_sta[currentAPIndex].enable) {
                        log_d("Reconnecting to current AP: %s", config.wifi_sta[currentAPIndex].wifi_ssid);
                        wifiStatus = WiFi.begin(
                            config.wifi_sta[currentAPIndex].wifi_ssid,
                            config.wifi_sta[currentAPIndex].wifi_pass
                        );
                    } else {
                        // Fallback to wifiMulti only if no current AP or current AP is disabled
                        log_d("Using wifiMulti to find available AP");
                        wifiStatus = wifiMulti.run();
                    }
                    vTaskDelay(2000 / portTICK_PERIOD_MS);
                }
            }
            else
            {
                wifiStatus = WL_CONNECTED;
            }
        }
#ifdef PPPOS
        if ((wifiStatus == WL_CONNECTED) || (PPP.connected()))
#else
        if ((wifiStatus == WL_CONNECTED))
#endif
        {
            // config.pwr_sleep_activate |= ACTIVATE_WIFI;
            if (millis() > NTP_Timeout)
            {
                NTP_Timeout = millis() + 86400000;
                // setSyncProvider(getNtpTime);
                log_d("Contacting Time Server\n");
                configTime(3600 * config.timeZone, 0, config.ntp_host);
                vTaskDelay(1000 / portTICK_PERIOD_MS);
                struct tm tmstruct;
                if (getLocalTime(&tmstruct, 1000))
                {
                    time_t systemTime;
                    time(&systemTime);
                    setTime(systemTime);
                    if (systemUptime == 0)
                    {
                        systemUptime = time(NULL);
                    }
                    pingTimeout = millis() + 2000;
                    if (config.vpn)
                    {
                        // if (wireguard_up())
                        //     log_d("Wireguard UP Link");
                        // else
                        //     log_d("Wireguard Connect Fail!");
                        log_d("Setup Wireguard Setup!");
                        vpnTimeout = millis() + 10000;
                        // if (wireguard_active()) wireguard_remove();
                        if (!wireguard_active())
                        {
                            // if (wireguard_active()) wireguard_remove();
                            log_d("Setup Wireguard VPN!");
                            if (WiFi.isConnected())
                            {
                                wireguard_setup();
                                vpnConnected = true;
                            }
                            else
                            {
#ifdef PPPOS
                                if (PPP.connected())
                                {
                                    wireguard_setup();
                                    vpnConnected = true;
                                }
#endif
                            }
                        }
                    }
                }
                else
                {
                    NTP_Timeout = millis() + 5000;
                }
            }

            if (millis() > vpnTimeout && !vpnConnected && config.vpn)
            {
                vpnTimeout = millis() + 10000;
                log_d("RENEW Device Wireguard VPN!");
                wireguard_change_device();
                vpnConnected = true;
            }

            if (config.igate_en)
            {
                if (aprsClient.connected() == false)
                {
                    if (millis() > waitISRetry)
                    {
                        waitISRetry = millis() + 30000; // Retry connect 30Sec
                        if (APRSConnect())
                        {
                            if (config.igate_bcn)
                            {
                                iGatetickInterval = millis() + 10000; // send position after 10sec
                            }
                        }
                    }
                }
                else
                {
                    if (aprsClient.available())
                    {
                        pingTimeout = millis() + 300000;                // Reset ping timout
                        String line = aprsClient.readStringUntil('\n'); // อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
                        status.isCount++;
                        int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
                        if (start_val > 3)
                        {
                            String src_call = line.substring(0, start_val);
                            String msg_call = "::" + src_call;

                            status.allCount++;
                            status.rxCount++;
                            igateTLM.RX++;

                            log_d("INET: %s\n", line.c_str());
                            start_val = line.indexOf(":", 10); // Search of info in ax25
                            if (start_val > 5)
                            {
                                String info = line.substring(start_val + 1);
                                size_t rawSize = line.length();
                                char *raw = (char *)calloc(rawSize + 1, sizeof(char));
                                if (raw)
                                {
                                    memset(raw, 0, rawSize + 1);
                                    memcpy(raw, info.c_str(), info.length());

                                    uint16_t type = pkgType(&raw[0]);
                                    if (type & FILTER_MESSAGE)
                                    {
                                        handleIncomingAPRS(line);
                                    }
                                    int start_dstssid = line.indexOf("-", 1); // get SSID -
                                    if (start_dstssid < 0)
                                        start_dstssid = line.indexOf(" ", 1); // get ssid space
                                    char ssid = 0;
                                    if (start_dstssid > 0)
                                        ssid = line.charAt(start_dstssid + 1);

