yo3gwm/ESP32APRS_Audio/src/main.cpp
            if (aprs.packettype & T_WAVE)
            {
                // Serial.println("WX Display");
                if (aprs.wave_report.flags & O_TEMP)
                {
                    display.setCursor(68, x += 10);
                    display.drawYBitmap(61, x, &Temperature_Symbol[0], 5, 8, WHITE);
                    // display.printf("%.2fC", aprs.wave_report.Temp);
                    display.print(aprs.wave_report.Temp, 2);
                    display.print("C");
                }
                if (aprs.wave_report.flags & O_HS)
                {
                    // display.setCursor(102, x);
                    display.setCursor(68, x += 9);
                    display.print("Hs: ");
                    // display.printf("%0.1f M", aprs.wave_report.Hs / 100);
                    display.print(aprs.wave_report.Hs / 100, 1);
                    display.print("M");
                }
                if (aprs.wave_report.flags & O_TZ)
                {
                    display.setCursor(68, x += 9);
                    display.print("Tz: ");
                    // display.printf("%0.1f S", aprs.wave_report.Tz);
                    display.print(aprs.wave_report.Tz, 1);
                    display.print("S");
                }
                // if (aprs.wave_report.flags & O_TC)
                // {
                //     display.setCursor(58, x += 9);
                //     display.printf("Tc: ");
                //     display.printf("%0.1fS.", aprs.wave_report.Tc);
                // }
                if (aprs.wave_report.flags & O_BAT)
                {
                    display.setCursor(68, x += 9);
                    display.print("BAT: ");
                    // display.printf("%0.2fV", aprs.wave_report.Bat);
                    display.print(aprs.wave_report.Bat, 2);
                    display.print("V");
                }
            }

            if (aprs.packettype & T_WX)
            {
                display.setFont();
                display.setTextColor(WHITE);
                // Serial.println("WX Display");
                if (aprs.wx_report.flags & W_TEMP)
                {
                    display.setCursor(68, x += 10);
                    display.drawYBitmap(61, x, &Temperature_Symbol[0], 5, 8, WHITE);
                    // display.printf("%.1fC", aprs.wx_report.temp);
                    display.print(aprs.wx_report.temp, 2);
                    display.print("C");
                }
                if (aprs.wx_report.flags & W_HUM)
                {
                    display.setCursor(122, x);
                    display.drawYBitmap(115, x, &Humidity_Symbol[0], 5, 8, WHITE);
                    display.printf("%0.1f%%", aprs.wx_report.humidity);
                }
                if (aprs.wx_report.flags & W_BAR)
                {
                    display.setCursor(68, x += 9);
                    display.drawYBitmap(61, x, &Pressure_Symbol[0], 5, 8, WHITE);
                    // display.printf("%.1fhPa", aprs.wx_report.pressure);
                    display.print(aprs.wx_report.pressure, 1);
                    display.print("hPa");
                }
                if (aprs.wx_report.flags & W_R24H)
                {
                    // if (aprs.wx_report.rain_1h > 0) {
                    display.setCursor(68, x += 9);
                    display.drawYBitmap(61, x, &Rain_Symbol[0], 5, 8, WHITE);
                    // display.printf("%.1fmm.", aprs.wx_report.rain_24h);
                    display.print(aprs.wx_report.rain_24h, 1);
                    display.print("mm");
                    //}
                }
                if (aprs.wx_report.flags & W_PAR)
                {
                    // if (aprs.wx_report.luminosity > 10) {
                    display.setCursor(61, x += 9);
                    display.printf("%c", 0x0f);
                    display.setCursor(68, x);
                    // display.printf("%dW/m", aprs.wx_report.luminosity);
                    display.print(aprs.wx_report.luminosity);
                    display.print("W/m");
                    if (aprs.wx_report.flags & W_UV)
                    {
                        // display.printf(" UV%d", aprs.wx_report.uv);
                        display.print("UV:");
                        display.print(aprs.wx_report.uv);
                    }
                    //}
                }
                if (aprs.wx_report.flags & W_WS)
                {
                    display.setCursor(68, x += 9);
                    display.drawYBitmap(61, x, &Wind_Symbol[0], 5, 8, WHITE);
                    // int dirIdx=map(aprs.wx_report.wind_dir, -180, 180, 0, 8); ((angle+22)/45)%8]
                    int dirIdx = ((aprs.wx_report.wind_dir + 22) / 45) % 8;
                    if (dirIdx > 8)
                        dirIdx = 8;
                    // display.printf("%.1fkPh(%s)", aprs.wx_report.wind_speed, directions[dirIdx]);
                    display.print(aprs.wx_report.wind_speed, 1);
                    display.print("kPh(");
                    display.print(directions[dirIdx]);
                    display.print(")");
                }
                // Serial.printf("%.1fkPh(%d)", aprs.wx_report.wind_speed, aprs.wx_report.wind_dir);
                if (aprs.flags & F_HASPOS)
                {
                    // Serial.println("POS Display");
                    double lat, lon;
                    if (gps.location.isValid())
                    {
                        lat = gps.location.lat();
                        lon = gps.location.lng();
                    }
                    else
                    {
                        lat = config.igate_lat;
                        lon = config.igate_lon;
                    }
                    double dtmp = aprsParse.direction(lon, lat, aprs.lng, aprs.lat);
                    double dist = aprsParse.distance(lon, lat, aprs.lng, aprs.lat);
                    if (config.h_up == true)
                    {
                        // double course = gps.course.deg();
                        double course = SB_HEADING;
                        if (dtmp >= course)
                        {
                            dtmp -= course;
                        }
                        else
                        {
                            double diff = dtmp - course;
                            dtmp = diff + 360.0F;
                        }
                        compass_label(25, 37, 20, course, ST77XX_GREEN);
                        display.setCursor(0, 17);
                        display.print("H");
                    }
                    else
                    {
                        compass_label(25, 37, 20, 0.0F, ST77XX_GREEN);
                    }
                    // compass_label(25, 37, 15, 0.0F, WHITE);
                    compass_arrow(25, 37, 17, dtmp, ST77XX_GREEN);
                    display.drawFastHLine(1, 73, 55, WHITE);
                    display.drawFastVLine(1, 68, 5, WHITE);
                    display.drawFastVLine(56, 68, 5, WHITE);
                    display.setCursor(4, 65);
                    // if (dist > 999)
                    //     //display.printf("%.fKm", dist);
                    //     display.print(dist,0);
                    // else
                    display.print(dist, 1);
                    display.print("Km");
                }
                else
                {
                    display.setCursor(20, 30);
                    display.print("NO\nPOSITION");
                }
            }
            else if (aprs.flags & F_HASPOS)
            {
                // display.setCursor(50, x += 10);
                // display.printf("LAT %.5f\n", aprs.lat);
                // display.setCursor(51, x+=9);
                // display.printf("LNG %.4f\n", aprs.lng);
                String str;
                int l = 0;
                display.setCursor(60, x += 10);
                display.print("LAT:");
                str = String(aprs.lat, 5);
                // l = str.length() * 6;
                // display.setCursor(160 - l-2, x);
                display.setCursor(85, x);
                display.print(str);

