yo3gwm/ESP32APRS_Audio/src/main.cpp
                display.setCursor(60, x += 9);
                display.print("LON:");
                str = String(aprs.lng, 5);
                // l = str.length() * 6;
                // display.setCursor(160 - l-2, x);
                display.setCursor(85, x);
                display.print(str);

                double lat, lon;
                if (gps.location.isValid())
                {
                    lat = gps.location.lat();
                    lon = gps.location.lng();
                }
                else
                {
                    lat = config.igate_lat;
                    lon = config.igate_lon;
                }
                double dtmp = aprsParse.direction(lon, lat, aprs.lng, aprs.lat);
                double dist = aprsParse.distance(lon, lat, aprs.lng, aprs.lat);
                if (config.h_up == true)
                {
                    // double course = gps.course.deg();
                    double course = SB_HEADING;
                    if (dtmp >= course)
                    {
                        dtmp -= course;
                    }
                    else
                    {
                        double diff = dtmp - course;
                        dtmp = diff + 360.0F;
                    }
                    compass_label(25, 37, 20, course, ST77XX_GREEN);
                    display.setCursor(0, 17);
                    display.print("H");
                }
                else
                {
                    compass_label(25, 43, 20, 0.0F, ST77XX_GREEN);
                }
                compass_arrow(25, 43, 17, dtmp, ST77XX_GREEN);
                // display.drawFastHLine(1, 65, 55, WHITE);
                // display.drawFastVLine(1, 65, 5, WHITE);
                // display.drawFastVLine(56, 65, 5, WHITE);
                display.setTextColor(ST77XX_ORANGE);
                display.setCursor(0, 70);
                // if (dist > 99)
                //     display.printf("DX:%dKm", (int)dist);
                // else
                //     display.printf("DX:%.1fKm", dist);
                display.print("DX:");
                display.print(dist, 1);
                display.print("Km");
                display.setTextColor(WHITE);
                if (aprs.flags & F_CSRSPD)
                {
                    display.setCursor(61, x += 9);
                    // display.printf("SPD %d/", aprs.course);
                    // display.setCursor(50, x += 9);
                    // display.printf("SPD %.1fkPh\n", aprs.speed);
                    display.print("SPD: ");
                    display.print(aprs.speed, 1);
                    display.print("Kph");
                    int dirIdx = ((aprs.course + 22) / 45) % 8;
                    if (dirIdx > 8)
                        dirIdx = 8;
                    display.setCursor(61, x += 9);
                    // display.printf("CSD %d(%s)", aprs.course, directions[dirIdx]);
                    display.print("CSD: ");
                    display.print(aprs.course);
                    display.print("(");
                    display.print(directions[dirIdx]);
                    display.print(")");
                }
                if (aprs.flags & F_ALT)
                {
                    display.setCursor(61, x += 9);
                    // display.printf("ALT %.1fM\n", aprs.altitude);
                    display.print("ALT: ");
                    display.print(aprs.altitude, 1);
                    display.print("M");
                }
                if (aprs.flags & F_PHG)
                {
                    int power, height, gain;
                    unsigned char tmp;
                    power = (int)aprs.phg[0] - 0x30;
                    power *= power;
                    height = (int)aprs.phg[1] - 0x30;
                    height = 10 << (height + 1);
                    height = height / 3.2808;
                    gain = (int)aprs.phg[2] - 0x30;
                    display.setCursor(61, x += 9);
                    // display.printf("PHG %dM.\n", height);
                    display.print("PHG: ");
                    display.print(height);
                    display.print("M");
                    display.setCursor(61, x += 9);
                    // display.printf("PWR %dWatt\n", power);
                    display.print("PWR: ");
                    display.print(power);
                    display.print("Watt");
                    display.setCursor(61, x += 9);
                    // display.printf("ANT %ddBi\n", gain);
                    display.print("ANT: ");
                    display.print(gain);
                    display.print("dBi");
                }
                if (aprs.flags & F_RNG)
                {
                    display.setCursor(61, x += 9);
                    // display.printf("RNG %dKm\n", aprs.radio_range);
                    display.print("RNG: ");
                    display.print(aprs.radio_range);
                    display.print("Km");
                }
                /*if (aprs.comment_len > 0) {
                    display.setCursor(0, 56);
                    display.print(aprs.comment);
                }*/
            }
            display.display();
#endif
        }
    }
}

void statisticsDisp()
{

    // uint8 wifi = 0, i;
    int x;
    String str;
    // display.fillRect(0, 16, 128, 10, WHITE);
    // display.drawLine(0, 16, 0, 63, WHITE);
    // display.drawLine(127, 16, 127, 63, WHITE);
    // display.drawLine(0, 63, 127, 63, WHITE);
    // display.fillRect(1, 25, 126, 38, BLACK);
    // display.setTextColor(BLACK);
    // display.setCursor(30, 17);
    // display.print("STATISTICS");
    // display.setCursor(108, 17);
    // display.print("1/5");
    // display.setTextColor(WHITE);
#ifdef OLED
#ifdef SSD1306_72x40
    display.clearDisplay();
    display.fillRect(0, 0, 72, 9, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(10, 1);
    display.print("STATISTIC");
    display.setTextColor(WHITE);
    display.setCursor(0, 12);
    display.print("A:");
    str = String(status.allCount, DEC);
    x = str.length() * 6;
    display.setCursor(71 - x, 12);
    display.print(str);
    display.setCursor(0, 22);
    display.print("G:");
    str = String(status.rf2inet, DEC);
    x = str.length() * 6;
    display.setCursor(71 - x, 22);
    display.print(str);
    display.setCursor(0, 32);
    display.print("E:");
    str = String(status.errorCount + status.dropCount, DEC);
    x = str.length() * 6;
    display.setCursor(71 - x, 32);
    display.print(str);
    display.display();
#else
    display.fillRect(0, 0, 128, 15, WHITE);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

