yo3gwm/ESP32APRS_Audio/src/main.cpp
        display.setCursor(3, 58);
        display.print("HDOP:");
        str = String(gps.hdop.hdop(), 2);
        x = str.length() * 6;
        display.setCursor(90 - x, 58);
        display.print(str);

        display.setCursor(3, 68);
        // display.print("TIME:");
        str = String(gps.date.day(), DEC) + "/" + String(gps.date.month(), DEC) + "/" + String(gps.date.year(), DEC);
        display.setCursor(3, 68);
        display.print(str);
        str = String(gps.time.hour(), DEC) + ":" + String(gps.time.minute(), DEC) + ":" + String(gps.time.second(), DEC) + "z";
        x = str.length() * 6;
        display.setCursor(158 - x, 68);
        display.print(str);
    }
    else
    {
        // display.fillRect(0, 0, 160, 80, BLACK);
        display.fillScreen(ST77XX_BLACK);
        display.setTextColor(ST77XX_CYAN);
        display.drawYBitmap(120, 0, &Icon_TableB[50][0], 16, 16, ST77XX_BLUE);
        display.setCursor(140, 7);
        display.print(gps.satellites.value());
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);

        struct tm tmstruct;
        char strTime[10];
        tmstruct.tm_year = 0;
        getLocalTime(&tmstruct, 100);
        sprintf(strTime, "%02d:%02d:%02d", tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        display.setCursor(0, 14);
        display.print(strTime);

        display.setFont(&FreeSerifItalic9pt7b);
        display.setCursor(90, 28);
        display.printf("km/h");

        display.setTextColor(ST77XX_RED);
        display.setFont(&Seven_Segment24pt7b);
        display.setCursor(70, 70);
        display.print(SB_SPEED, DEC);

        compass_label(30, 47, 24, 0.0F, ST77XX_GREEN);
        compass_arrow(30, 47, 20, SB_HEADING, ST77XX_GREEN);
        display.drawLine(0, 16, 70, 16, WHITE);
        display.drawLine(70, 16, 80, 29, WHITE);
        display.drawLine(60, 16, 70, 29, WHITE);
        display.drawLine(70, 29, 159, 29, WHITE);
        display.setFont();
    }
    display.display();
#endif
}

#endif